UC Berkeley, ABC 1.01 (compiled Dec  1 2023 18:58:55)
================== Command history ==================
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex03.truth
source -s abc.rc
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex04.truth
resyn
resyn2
resyn3
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex04.truth/iter0.aig
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex04.truth/iter1.aig
source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex04.truth/iter2.aig
=====================================================
abc 01> read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex07.truth
abc 02> resyn
abc 05> resyn2
abc 09> resyn3
abc 13> resyn
abc 16> resyn2
abc 20> resyn3
abc 24> resyn
abc 27> resyn2
abc 31> resyn3
abc 35> resyn
abc 38> resyn2
abc 42> resyn3
abc 46> resyn
abc 49> resyn2
abc 53> resyn3
abc 57> resyn
abc 60> resyn2
abc 64> resyn3
abc 68> ps
[1;37mex                            :[0m i/o =    6/    5  lat =    0  and =     38  lev =  6
abc 68> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.00 sec
subCircuit with size 2
Time =     0.00 sec
subCircuit with size 3
Time =     0.01 sec
subCircuit with size 4
Time =     0.02 sec
subCircuit with size 5
Time =     0.15 sec
subCircuit with size 6
Time =     1.05 sec
subCircuit with size 7
Time =     1.99 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =    6/    5  lat =    0  and =     38  lev =  6
[1;37mex                            :[0m i/o =    6/    5  lat =    0  and =     38  lev =  6
abc 80> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex07.truth/iter0.aig
abc 80> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.00 sec
subCircuit with size 2
Time =     0.00 sec
subCircuit with size 3
Time =     0.00 sec
subCircuit with size 4
Time =     0.01 sec
subCircuit with size 5
Time =     0.12 sec
subCircuit with size 6
Time =     0.24 sec
Success reduce subcircuit from 6 to 6
[1;37mex                            :[0m i/o =    6/    5  lat =    0  and =     38  lev =  6
[1;37mex                            :[0m i/o =    6/    5  lat =    0  and =     38  lev =  6
abc 92> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex07.truth/iter1.aig
abc 92> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.00 sec
subCircuit with size 2
Time =     0.00 sec
subCircuit with size 3
Time =     0.00 sec
subCircuit with size 4
Time =     0.02 sec
subCircuit with size 5
Time =     0.12 sec
subCircuit with size 6
