UC Berkeley, ABC 1.01 (compiled Dec  1 2023 18:58:55)
================== Command history ==================
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex04.truth/iter1.aig
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex04.truth/iter2.aig
source -s abc.rc
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex07.truth
resyn
resyn2
resyn3
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex07.truth/iter0.aig
source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex07.truth/iter1.aig
=====================================================
abc 01> read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex08.truth
abc 02> resyn
abc 05> resyn2
abc 09> resyn3
abc 13> resyn
abc 16> resyn2
abc 20> resyn3
abc 24> resyn
abc 27> resyn2
abc 31> resyn3
abc 35> resyn
abc 38> resyn2
abc 42> resyn3
abc 46> resyn
abc 49> resyn2
abc 53> resyn3
abc 57> resyn
abc 60> resyn2
abc 64> resyn3
abc 68> ps
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
abc 68> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     2.85 sec
subCircuit with size 2
Time =     7.08 sec
subCircuit with size 3
Time =    28.83 sec
subCircuit with size 4
Time =   107.22 sec
subCircuit with size 5
Time =   112.59 sec
subCircuit with size 6
Time =   144.71 sec
subCircuit with size 7
Time =   125.70 sec
subCircuit with size 1
Time =     9.09 sec
subCircuit with size 2
Time =    21.21 sec
subCircuit with size 3
Time =    34.56 sec
subCircuit with size 4
Time =    55.53 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
abc 80> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex08.truth/iter0.aig
abc 80> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     4.09 sec
subCircuit with size 2
Time =     6.88 sec
subCircuit with size 3
Time =    20.61 sec
subCircuit with size 4
Time =    77.73 sec
subCircuit with size 5
Time =   116.37 sec
subCircuit with size 6
Time =   114.02 sec
subCircuit with size 7
Time =   121.65 sec
subCircuit with size 1
Time =     1.67 sec
subCircuit with size 2
Time =     3.67 sec
subCircuit with size 3
Time =     4.05 sec
subCircuit with size 4
Time =    21.75 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
abc 92> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex08.truth/iter1.aig
abc 92> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     1.36 sec
subCircuit with size 2
Time =     7.94 sec
subCircuit with size 3
Time =    31.72 sec
subCircuit with size 4
Time =   119.55 sec
subCircuit with size 5
Time =   114.97 sec
subCircuit with size 6
Time =   127.87 sec
subCircuit with size 7
Time =   136.05 sec
subCircuit with size 1
Time =     3.66 sec
subCircuit with size 2
Time =     6.49 sec
subCircuit with size 3
Time =     9.33 sec
subCircuit with size 4
Time =    76.38 sec
subCircuit with size 5
Time =   150.84 sec
subCircuit with size 6
Time =   117.13 sec
subCircuit with size 7
Time =   132.07 sec
subCircuit with size 1
Time =     5.15 sec
subCircuit with size 2
Time =     8.41 sec
subCircuit with size 3
Time =    12.41 sec
subCircuit with size 4
Time =    34.31 sec
subCircuit with size 5
Time =   107.07 sec
subCircuit with size 6
Time =   131.98 sec
subCircuit with size 7
Time =   129.45 sec
subCircuit with size 1
Time =     2.33 sec
subCircuit with size 2
Time =    10.79 sec
subCircuit with size 3
Time =    36.93 sec
subCircuit with size 4
Time =   109.09 sec
subCircuit with size 5
Time =   130.82 sec
subCircuit with size 6
Time =   123.76 sec
subCircuit with size 7
Time =   121.93 sec
subCircuit with size 1
Time =     6.21 sec
subCircuit with size 2
Time =     8.34 sec
subCircuit with size 3
Time =     8.36 sec
subCircuit with size 4
Time =    14.90 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
abc 104> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex08.truth/iter2.aig
abc 104> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     7.32 sec
subCircuit with size 2
Time =     9.20 sec
subCircuit with size 3
Time =    12.28 sec
subCircuit with size 4
Time =    34.24 sec
subCircuit with size 5
Time =   126.95 sec
subCircuit with size 6
Time =   312.27 sec
subCircuit with size 7
Time =   193.43 sec
subCircuit with size 1
Time =     2.32 sec
subCircuit with size 2
Time =     5.56 sec
subCircuit with size 3
Time =     5.84 sec
subCircuit with size 4
Time =    24.57 sec
subCircuit with size 5
Time =    56.54 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
abc 116> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex08.truth/iter3.aig
abc 116> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     2.98 sec
subCircuit with size 2
Time =    11.42 sec
subCircuit with size 3
Time =    38.27 sec
subCircuit with size 4
Time =   142.54 sec
subCircuit with size 5
Time =   191.07 sec
subCircuit with size 6
Time =   140.85 sec
subCircuit with size 7
Time =   121.80 sec
subCircuit with size 1
Time =     1.78 sec
subCircuit with size 2
Time =     3.79 sec
subCircuit with size 3
Time =     6.54 sec
subCircuit with size 4
Time =    80.65 sec
subCircuit with size 5
Time =   115.59 sec
subCircuit with size 6
Time =   127.47 sec
subCircuit with size 7
Time =   127.08 sec
subCircuit with size 1
Time =     4.16 sec
subCircuit with size 2
Time =     6.23 sec
subCircuit with size 3
Time =     6.74 sec
subCircuit with size 4
Time =    15.52 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
abc 128> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex08.truth/iter4.aig
abc 128> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     2.55 sec
subCircuit with size 2
Time =    13.17 sec
subCircuit with size 3
Time =    38.27 sec
subCircuit with size 4
Time =   111.16 sec
subCircuit with size 5
Time =   123.89 sec
subCircuit with size 6
Time =   115.73 sec
subCircuit with size 7
Time =   134.30 sec
subCircuit with size 1
Time =     1.52 sec
subCircuit with size 2
Time =     5.41 sec
subCircuit with size 3
Time =    22.28 sec
subCircuit with size 4
Time =   116.03 sec
subCircuit with size 5
Time =   135.29 sec
subCircuit with size 6
Time =   115.45 sec
subCircuit with size 7
Time =   130.32 sec
subCircuit with size 1
Time =     6.91 sec
subCircuit with size 2
Time =     9.69 sec
subCircuit with size 3
Time =    60.62 sec
subCircuit with size 4
Time =   118.92 sec
subCircuit with size 5
Time =   141.18 sec
subCircuit with size 6
Time =   145.45 sec
subCircuit with size 7
Time =   234.25 sec
subCircuit with size 1
Time =     3.91 sec
subCircuit with size 2
Time =     6.00 sec
subCircuit with size 3
Time =     8.08 sec
subCircuit with size 4
Time =    25.28 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
abc 140> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex08.truth/iter5.aig
abc 140> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     1.90 sec
subCircuit with size 2
Time =     3.72 sec
subCircuit with size 3
Time =    44.20 sec
subCircuit with size 4
Time =   116.40 sec
subCircuit with size 5
Time =  1086.87 sec
subCircuit with size 6
Time =   172.96 sec
subCircuit with size 7
Time =   120.23 sec
subCircuit with size 1
Time =     2.06 sec
subCircuit with size 2
Time =     7.26 sec
subCircuit with size 3
Time =    45.55 sec
subCircuit with size 4
Time =   147.26 sec
subCircuit with size 5
Time =   114.78 sec
subCircuit with size 6
Time =   119.10 sec
subCircuit with size 7
Time =   132.69 sec
subCircuit with size 1
Time =     3.18 sec
subCircuit with size 2
Time =     6.50 sec
subCircuit with size 3
Time =    29.06 sec
subCircuit with size 4
Time =   142.90 sec
subCircuit with size 5
Time =   129.13 sec
subCircuit with size 6
Time =   122.16 sec
subCircuit with size 7
Time =   126.41 sec
subCircuit with size 1
Time =     0.86 sec
subCircuit with size 2
Time =     3.42 sec
subCircuit with size 3
Time =     9.54 sec
subCircuit with size 4
Time =    36.38 sec
subCircuit with size 5
Time =   137.26 sec
subCircuit with size 6
Time =   120.29 sec
subCircuit with size 7
Time =   138.65 sec
subCircuit with size 1
Time =     4.53 sec
subCircuit with size 2
Time =    19.47 sec
subCircuit with size 3
Time =   102.03 sec
subCircuit with size 4
Time =   115.96 sec
subCircuit with size 5
Time =   149.45 sec
subCircuit with size 6
Time =   127.78 sec
subCircuit with size 7
Time =   132.74 sec
subCircuit with size 1
Time =     2.08 sec
subCircuit with size 2
Time =     7.61 sec
subCircuit with size 3
Time =    35.87 sec
subCircuit with size 4
Time =   144.08 sec
subCircuit with size 5
Time =   178.30 sec
subCircuit with size 6
Time =   114.35 sec
subCircuit with size 7
Time =   120.39 sec
subCircuit with size 1
Time =     2.58 sec
subCircuit with size 2
Time =     8.98 sec
subCircuit with size 3
Time =    29.68 sec
subCircuit with size 4
Time =   108.09 sec
subCircuit with size 5
Time =   113.57 sec
subCircuit with size 6
Time =   116.75 sec
subCircuit with size 7
Time =   122.87 sec
subCircuit with size 1
Time =     2.09 sec
subCircuit with size 2
Time =     7.57 sec
subCircuit with size 3
Time =    18.19 sec
subCircuit with size 4
Time =   109.24 sec
subCircuit with size 5
Time =   133.03 sec
subCircuit with size 1
Time =     4.04 sec
subCircuit with size 2
Time =     7.90 sec
subCircuit with size 3
Time =    17.47 sec
subCircuit with size 4
Time =    46.02 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
[1;37mex                            :[0m i/o =   16/    5  lat =    0  and =   2477  lev = 20
abc 152> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex08.truth/iter6.aig
abc 152> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     3.34 sec
subCircuit with size 2
Time =     9.34 sec
subCircuit with size 3
Time =    31.71 sec
subCircuit with size 4
Time =   121.49 sec
subCircuit with size 5
Time =   198.33 sec
subCircuit with size 6
Time =   158.19 sec
subCircuit with size 7
Time =   129.27 sec
subCircuit with size 1
Time =     2.15 sec
subCircuit with size 2
Time =     9.16 sec
subCircuit with size 3
Time =    30.24 sec
subCircuit with size 4
Time =   111.85 sec
subCircuit with size 5
Time =   117.74 sec
subCircuit with size 6
Time =   119.75 sec
subCircuit with size 7
Time =   124.39 sec
subCircuit with size 1
Time =     1.61 sec
subCircuit with size 2
Time =     6.75 sec
subCircuit with size 3
Time =    43.26 sec
subCircuit with size 4
Time =   181.29 sec
subCircuit with size 5
Time =   191.42 sec
subCircuit with size 6
Time =   121.33 sec
subCircuit with size 7
