UC Berkeley, ABC 1.01 (compiled Dec  1 2023 18:58:55)
================== Command history ==================
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex07.truth
resyn
resyn2
resyn3
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex07.truth/iter0.aig
source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex07.truth/iter1.aig
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex08.truth
source -s abc.rc
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex09.truth
=====================================================
abc 01> read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex10.truth
abc 02> resyn
abc 05> resyn2
abc 09> resyn3
abc 13> resyn
abc 16> resyn2
abc 20> resyn3
abc 24> resyn
abc 27> resyn2
abc 31> resyn3
abc 35> resyn
abc 38> resyn2
abc 42> resyn3
abc 46> resyn
abc 49> resyn2
abc 53> resyn3
abc 57> resyn
abc 60> resyn2
abc 64> resyn3
abc 68> ps
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    211  lev = 12
abc 68> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.07 sec
subCircuit with size 2
Time =     0.12 sec
subCircuit with size 3
Time =     0.17 sec
subCircuit with size 4
Time =     0.24 sec
subCircuit with size 5
Time =     0.85 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    211  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    211  lev = 12
abc 80> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter0.aig
abc 80> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.06 sec
subCircuit with size 3
Time =     0.14 sec
subCircuit with size 4
Time =     0.19 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    211  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 92> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter1.aig
abc 92> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.16 sec
subCircuit with size 3
Time =     0.62 sec
subCircuit with size 4
Time =     1.75 sec
subCircuit with size 5
Time =     8.32 sec
subCircuit with size 6
Time =    41.57 sec
subCircuit with size 7
Time =    14.93 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 104> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter2.aig
abc 104> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.04 sec
subCircuit with size 3
Time =     0.05 sec
subCircuit with size 4
Time =     0.07 sec
subCircuit with size 5
Time =     0.12 sec
subCircuit with size 6
Time =     0.24 sec
subCircuit with size 7
Time =     1.60 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 116> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter3.aig
abc 116> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.03 sec
subCircuit with size 2
Time =     0.05 sec
subCircuit with size 3
Time =     0.06 sec
subCircuit with size 4
Time =     0.18 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 128> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter4.aig
abc 128> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.05 sec
subCircuit with size 3
Time =     0.06 sec
subCircuit with size 4
Time =     0.19 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 140> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter5.aig
abc 140> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.06 sec
subCircuit with size 3
Time =     0.08 sec
subCircuit with size 4
Time =     0.11 sec
subCircuit with size 5
Time =     0.26 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 152> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter6.aig
abc 152> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.06 sec
subCircuit with size 3
Time =     0.07 sec
subCircuit with size 4
Time =     0.11 sec
subCircuit with size 5
Time =     0.26 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 164> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter7.aig
abc 164> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.03 sec
subCircuit with size 2
Time =     0.05 sec
subCircuit with size 3
Time =     0.08 sec
subCircuit with size 4
Time =     0.19 sec
subCircuit with size 5
Time =     0.46 sec
subCircuit with size 6
Time =     4.58 sec
subCircuit with size 7
Time =    15.43 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 176> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter8.aig
abc 176> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.07 sec
subCircuit with size 3
Time =     0.49 sec
subCircuit with size 4
Time =     2.57 sec
subCircuit with size 5
Time =    15.96 sec
subCircuit with size 6
Time =    78.98 sec
subCircuit with size 7
Time =   101.60 sec
subCircuit with size 1
Time =     0.01 sec
subCircuit with size 2
Time =     0.02 sec
subCircuit with size 3
Time =     0.03 sec
subCircuit with size 4
Time =     0.05 sec
subCircuit with size 5
Time =     0.56 sec
subCircuit with size 6
Time =     7.72 sec
subCircuit with size 7
Time =     7.19 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 188> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter9.aig
abc 188> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.03 sec
subCircuit with size 2
Time =     0.05 sec
subCircuit with size 3
Time =     0.07 sec
subCircuit with size 4
Time =     0.09 sec
subCircuit with size 5
Time =     0.29 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 200> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter10.aig
abc 200> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.03 sec
subCircuit with size 3
Time =     0.04 sec
subCircuit with size 4
Time =     0.05 sec
subCircuit with size 5
Time =     0.10 sec
subCircuit with size 6
Time =     0.33 sec
Success reduce subcircuit from 6 to 6
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 212> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter11.aig
abc 212> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.04 sec
subCircuit with size 3
Time =     0.05 sec
subCircuit with size 4
Time =     0.06 sec
subCircuit with size 5
Time =     0.11 sec
subCircuit with size 6
Time =     0.40 sec
Success reduce subcircuit from 6 to 6
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 224> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter12.aig
abc 224> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.05 sec
subCircuit with size 2
Time =     0.11 sec
subCircuit with size 3
Time =     0.18 sec
subCircuit with size 4
Time =     0.17 sec
subCircuit with size 5
Time =     0.25 sec
subCircuit with size 6
Time =     8.77 sec
subCircuit with size 7
Time =    15.91 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 236> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter13.aig
abc 236> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.04 sec
subCircuit with size 3
Time =     0.06 sec
subCircuit with size 4
Time =     0.57 sec
subCircuit with size 5
Time =     0.42 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 248> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter14.aig
abc 248> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.01 sec
subCircuit with size 2
Time =     0.03 sec
subCircuit with size 3
Time =     0.08 sec
subCircuit with size 4
Time =     0.24 sec
subCircuit with size 5
Time =     1.32 sec
subCircuit with size 6
Time =     4.36 sec
subCircuit with size 7
Time =    10.83 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 260> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter15.aig
abc 260> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.05 sec
subCircuit with size 2
Time =     0.06 sec
subCircuit with size 3
Time =     0.07 sec
subCircuit with size 4
Time =     0.08 sec
subCircuit with size 5
Time =     0.13 sec
subCircuit with size 6
Time =     0.26 sec
subCircuit with size 7
Time =     1.74 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 272> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter16.aig
abc 272> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.07 sec
subCircuit with size 3
Time =     0.10 sec
subCircuit with size 4
Time =     0.47 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 284> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter17.aig
abc 284> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.07 sec
subCircuit with size 3
Time =     0.10 sec
subCircuit with size 4
Time =     0.46 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
abc 296> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter18.aig
abc 296> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.11 sec
subCircuit with size 3
Time =     0.57 sec
subCircuit with size 4
Time =     2.25 sec
subCircuit with size 5
Time =     4.84 sec
subCircuit with size 6
Time =    37.83 sec
subCircuit with size 7
Time =    15.16 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    209  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    208  lev = 12
abc 308> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter19.aig
abc 308> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.08 sec
subCircuit with size 3
Time =     0.65 sec
subCircuit with size 4
Time =     2.58 sec
subCircuit with size 5
Time =     9.25 sec
subCircuit with size 6
Time =    58.62 sec
subCircuit with size 7
Time =    55.96 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    208  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    208  lev = 12
abc 320> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter20.aig
abc 320> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.07 sec
subCircuit with size 3
Time =     0.24 sec
subCircuit with size 4
Time =     0.99 sec
subCircuit with size 5
Time =     4.09 sec
subCircuit with size 6
Time =    22.01 sec
subCircuit with size 7
Time =    49.39 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    208  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    208  lev = 12
abc 332> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter21.aig
abc 332> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.07 sec
subCircuit with size 3
Time =     0.18 sec
subCircuit with size 4
Time =     1.08 sec
subCircuit with size 5
Time =     5.05 sec
subCircuit with size 6
Time =    11.89 sec
Success reduce subcircuit from 7 to 6
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    207  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    207  lev = 12
abc 344> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter22.aig
abc 344> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.03 sec
subCircuit with size 2
Time =     0.07 sec
subCircuit with size 3
Time =     0.12 sec
subCircuit with size 4
Time =     0.83 sec
subCircuit with size 5
Time =     5.13 sec
subCircuit with size 6
Time =    33.51 sec
subCircuit with size 7
Time =    36.59 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    207  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    207  lev = 12
abc 356> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter23.aig
abc 356> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.09 sec
subCircuit with size 3
Time =     0.14 sec
subCircuit with size 4
Time =     1.12 sec
subCircuit with size 5
Time =     2.87 sec
subCircuit with size 6
Time =    15.44 sec
subCircuit with size 7
Time =    34.75 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    207  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    207  lev = 12
abc 368> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter24.aig
abc 368> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.03 sec
subCircuit with size 2
Time =     0.05 sec
subCircuit with size 3
Time =     0.07 sec
subCircuit with size 4
Time =     0.10 sec
subCircuit with size 5
Time =     0.16 sec
subCircuit with size 6
Time =     0.38 sec
Success reduce subcircuit from 6 to 6
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    207  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    207  lev = 12
abc 380> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter25.aig
abc 380> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.06 sec
subCircuit with size 3
Time =     0.39 sec
subCircuit with size 4
Time =     2.69 sec
subCircuit with size 5
Time =    10.61 sec
subCircuit with size 6
Time =    65.74 sec
subCircuit with size 7
Time =    67.16 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    207  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    205  lev = 11
abc 392> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter26.aig
abc 392> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.05 sec
subCircuit with size 2
Time =     0.08 sec
subCircuit with size 3
Time =     0.07 sec
subCircuit with size 4
Time =     0.13 sec
subCircuit with size 5
Time =     0.28 sec
subCircuit with size 6
Time =     3.51 sec
subCircuit with size 7
Time =     7.60 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    205  lev = 11
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    205  lev = 11
abc 404> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter27.aig
abc 404> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.13 sec
subCircuit with size 3
Time =     0.50 sec
subCircuit with size 4
Time =     1.85 sec
subCircuit with size 5
Time =    14.13 sec
subCircuit with size 6
Time =    66.21 sec
Success reduce subcircuit from 7 to 6
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    204  lev = 11
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    204  lev = 11
abc 416> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter28.aig
abc 416> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.05 sec
subCircuit with size 2
Time =     0.08 sec
subCircuit with size 3
Time =     0.12 sec
subCircuit with size 4
Time =     0.27 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    204  lev = 11
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    204  lev = 11
abc 428> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter29.aig
abc 428> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.05 sec
subCircuit with size 2
Time =     0.09 sec
subCircuit with size 3
Time =     0.12 sec
subCircuit with size 4
Time =     0.16 sec
subCircuit with size 5
Time =     0.25 sec
subCircuit with size 6
Time =     0.24 sec
subCircuit with size 7
Time =     0.99 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    204  lev = 11
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    204  lev = 11
abc 440> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter30.aig
abc 440> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.09 sec
subCircuit with size 3
Time =     0.41 sec
subCircuit with size 4
Time =     1.73 sec
subCircuit with size 5
Time =     4.27 sec
subCircuit with size 6
Time =    15.33 sec
subCircuit with size 7
Time =    39.48 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    204  lev = 11
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    204  lev = 11
abc 452> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter31.aig
abc 452> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.03 sec
subCircuit with size 2
Time =     0.07 sec
subCircuit with size 3
Time =     0.20 sec
subCircuit with size 4
Time =     1.72 sec
subCircuit with size 5
Time =     6.87 sec
subCircuit with size 6
Time =    59.09 sec
subCircuit with size 7
Time =   100.77 sec
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.05 sec
subCircuit with size 3
Time =     0.16 sec
subCircuit with size 4
Time =     0.64 sec
subCircuit with size 5
Time =     6.21 sec
subCircuit with size 6
Time =    28.96 sec
subCircuit with size 7
Time =    94.24 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    204  lev = 11
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    204  lev = 11
abc 464> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter32.aig
abc 464> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.03 sec
subCircuit with size 2
Time =     0.06 sec
subCircuit with size 3
Time =     0.16 sec
subCircuit with size 4
Time =     0.75 sec
subCircuit with size 5
Time =     4.09 sec
subCircuit with size 6
Time =    19.14 sec
subCircuit with size 7
Time =    32.01 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    204  lev = 11
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    204  lev = 11
abc 476> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter33.aig
abc 476> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.03 sec
subCircuit with size 2
Time =     0.04 sec
subCircuit with size 3
Time =     0.07 sec
subCircuit with size 4
Time =     0.60 sec
subCircuit with size 5
Time =     1.53 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    204  lev = 11
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    204  lev = 11
abc 488> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter34.aig
abc 488> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.04 sec
subCircuit with size 3
Time =     0.15 sec
subCircuit with size 4
Time =     0.58 sec
subCircuit with size 5
Time =     4.12 sec
subCircuit with size 6
Time =     6.17 sec
Success reduce subcircuit from 7 to 6
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    203  lev = 11
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    203  lev = 11
abc 500> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter35.aig
abc 500> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.05 sec
subCircuit with size 2
Time =     0.09 sec
subCircuit with size 3
Time =     0.23 sec
subCircuit with size 4
Time =     0.36 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    203  lev = 11
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    203  lev = 11
abc 512> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter36.aig
abc 512> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.05 sec
subCircuit with size 2
Time =     0.10 sec
subCircuit with size 3
Time =     0.12 sec
subCircuit with size 4
Time =     0.18 sec
subCircuit with size 5
Time =     0.60 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    203  lev = 11
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    203  lev = 11
abc 524> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter37.aig
abc 524> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.07 sec
subCircuit with size 3
Time =     0.38 sec
subCircuit with size 4
Time =     2.34 sec
subCircuit with size 5
Time =    10.77 sec
subCircuit with size 6
Time =    49.04 sec
subCircuit with size 7
Time =   101.83 sec
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.08 sec
subCircuit with size 3
Time =     0.42 sec
subCircuit with size 4
Time =     2.43 sec
subCircuit with size 5
Time =    12.67 sec
subCircuit with size 6
Time =    17.43 sec
Success reduce subcircuit from 7 to 6
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    202  lev = 12
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    202  lev = 11
abc 536> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter38.aig
abc 536> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.03 sec
subCircuit with size 3
Time =     0.11 sec
subCircuit with size 4
Time =     0.40 sec
subCircuit with size 5
Time =     2.32 sec
Success reduce subcircuit from 7 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    200  lev = 16
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    199  lev = 13
abc 548> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter39.aig
abc 548> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.05 sec
subCircuit with size 2
Time =     0.09 sec
subCircuit with size 3
Time =     0.12 sec
subCircuit with size 4
Time =     0.32 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    199  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    197  lev = 13
abc 560> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter40.aig
abc 560> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.06 sec
subCircuit with size 3
Time =     0.08 sec
subCircuit with size 4
Time =     0.14 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    197  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    197  lev = 13
abc 572> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter41.aig
abc 572> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.03 sec
subCircuit with size 2
Time =     0.08 sec
subCircuit with size 3
Time =     0.39 sec
subCircuit with size 4
Time =     1.01 sec
subCircuit with size 5
Time =     3.31 sec
subCircuit with size 6
Time =    21.20 sec
subCircuit with size 7
Time =    27.98 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    197  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 584> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter42.aig
abc 584> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.04 sec
subCircuit with size 3
Time =     0.05 sec
subCircuit with size 4
Time =     0.07 sec
subCircuit with size 5
Time =     0.40 sec
subCircuit with size 6
Time =     2.55 sec
Success reduce subcircuit from 6 to 6
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 596> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter43.aig
abc 596> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.09 sec
subCircuit with size 3
Time =     0.54 sec
subCircuit with size 4
Time =     0.43 sec
subCircuit with size 5
Time =     1.49 sec
subCircuit with size 6
Time =     7.50 sec
subCircuit with size 7
Time =    22.37 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 608> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter44.aig
abc 608> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.01 sec
subCircuit with size 2
Time =     0.03 sec
subCircuit with size 3
Time =     0.05 sec
subCircuit with size 4
Time =     0.23 sec
subCircuit with size 5
Time =     1.19 sec
subCircuit with size 6
Time =     6.50 sec
subCircuit with size 7
Time =     6.87 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 620> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter45.aig
abc 620> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.11 sec
subCircuit with size 3
Time =     0.33 sec
subCircuit with size 4
Time =     0.81 sec
subCircuit with size 5
Time =     6.90 sec
subCircuit with size 6
Time =    51.85 sec
subCircuit with size 7
Time =    78.20 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 632> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter46.aig
abc 632> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.09 sec
subCircuit with size 3
Time =     0.62 sec
subCircuit with size 4
Time =     0.88 sec
subCircuit with size 5
Time =     3.16 sec
subCircuit with size 6
Time =     7.71 sec
subCircuit with size 7
Time =    23.44 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 644> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter47.aig
abc 644> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.05 sec
subCircuit with size 2
Time =     0.09 sec
subCircuit with size 3
Time =     0.15 sec
subCircuit with size 4
Time =     0.27 sec
subCircuit with size 5
Time =     1.41 sec
subCircuit with size 6
Time =     4.19 sec
subCircuit with size 7
Time =    14.31 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 656> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter48.aig
abc 656> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.08 sec
subCircuit with size 3
Time =     0.11 sec
subCircuit with size 4
Time =     0.18 sec
subCircuit with size 5
Time =     1.09 sec
subCircuit with size 6
Time =     9.09 sec
subCircuit with size 7
Time =     6.81 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 668> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter49.aig
abc 668> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.07 sec
subCircuit with size 3
Time =     0.08 sec
subCircuit with size 4
Time =     0.13 sec
subCircuit with size 5
Time =     0.25 sec
subCircuit with size 6
Time =     3.16 sec
subCircuit with size 7
Time =    26.77 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 680> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter50.aig
abc 680> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.05 sec
subCircuit with size 2
Time =     0.08 sec
subCircuit with size 3
Time =     0.11 sec
subCircuit with size 4
Time =     0.32 sec
subCircuit with size 5
Time =     1.45 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 692> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter51.aig
abc 692> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.09 sec
subCircuit with size 3
Time =     0.16 sec
subCircuit with size 4
Time =     0.28 sec
subCircuit with size 5
Time =     0.42 sec
subCircuit with size 6
Time =     6.89 sec
subCircuit with size 7
Time =    18.72 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 704> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter52.aig
abc 704> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.03 sec
subCircuit with size 2
Time =     0.06 sec
subCircuit with size 3
Time =     0.14 sec
subCircuit with size 4
Time =     0.52 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 716> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter53.aig
abc 716> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.01 sec
subCircuit with size 2
Time =     0.02 sec
subCircuit with size 3
Time =     0.03 sec
subCircuit with size 4
Time =     0.30 sec
subCircuit with size 5
Time =     0.34 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 728> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter54.aig
abc 728> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.03 sec
subCircuit with size 2
Time =     0.06 sec
subCircuit with size 3
Time =     0.07 sec
subCircuit with size 4
Time =     0.17 sec
subCircuit with size 5
Time =     0.47 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 740> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter55.aig
abc 740> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.03 sec
subCircuit with size 2
Time =     0.05 sec
subCircuit with size 3
Time =     0.07 sec
subCircuit with size 4
Time =     0.17 sec
subCircuit with size 5
Time =     0.46 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 752> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter56.aig
abc 752> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.05 sec
subCircuit with size 3
Time =     0.18 sec
subCircuit with size 4
Time =     0.58 sec
subCircuit with size 5
Time =     1.22 sec
subCircuit with size 6
Time =     5.53 sec
subCircuit with size 7
Time =    11.97 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 764> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter57.aig
abc 764> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.03 sec
subCircuit with size 3
Time =     0.06 sec
subCircuit with size 4
Time =     0.39 sec
subCircuit with size 5
Time =     1.35 sec
subCircuit with size 6
Time =    11.31 sec
subCircuit with size 7
Time =     6.44 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 776> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter58.aig
abc 776> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.07 sec
subCircuit with size 3
Time =     0.10 sec
subCircuit with size 4
Time =     0.35 sec
subCircuit with size 5
Time =     1.77 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 788> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter59.aig
abc 788> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.05 sec
subCircuit with size 2
Time =     0.10 sec
subCircuit with size 3
Time =     0.19 sec
subCircuit with size 4
Time =     0.74 sec
subCircuit with size 5
Time =     2.09 sec
subCircuit with size 6
Time =     6.86 sec
subCircuit with size 7
Time =    14.40 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 800> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter60.aig
abc 800> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.04 sec
subCircuit with size 3
Time =     0.04 sec
subCircuit with size 4
Time =     0.19 sec
subCircuit with size 5
Time =     0.24 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 812> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter61.aig
abc 812> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.01 sec
subCircuit with size 2
Time =     0.02 sec
subCircuit with size 3
Time =     0.03 sec
subCircuit with size 4
Time =     0.21 sec
subCircuit with size 5
Time =     0.41 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 824> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter62.aig
abc 824> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.04 sec
subCircuit with size 3
Time =     0.09 sec
subCircuit with size 4
Time =     0.15 sec
subCircuit with size 5
Time =     0.27 sec
subCircuit with size 6
Time =     6.99 sec
subCircuit with size 7
Time =     6.37 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 836> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter63.aig
abc 836> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.06 sec
subCircuit with size 3
Time =     0.23 sec
subCircuit with size 4
Time =     0.71 sec
subCircuit with size 5
Time =     2.37 sec
subCircuit with size 6
Time =     7.55 sec
subCircuit with size 7
Time =    26.97 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 13
abc 848> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter64.aig
abc 848> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.05 sec
subCircuit with size 2
Time =     0.10 sec
subCircuit with size 3
Time =     0.42 sec
subCircuit with size 4
Time =     0.61 sec
subCircuit with size 5
Time =     2.40 sec
subCircuit with size 6
Time =    13.89 sec
subCircuit with size 7
Time =    23.18 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    196  lev = 16
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    195  lev = 15
abc 860> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter65.aig
abc 860> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.03 sec
subCircuit with size 3
Time =     0.05 sec
subCircuit with size 4
Time =     0.10 sec
subCircuit with size 5
Time =     0.68 sec
subCircuit with size 6
Time =     2.45 sec
subCircuit with size 7
Time =     1.95 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    195  lev = 15
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    195  lev = 15
abc 872> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter66.aig
abc 872> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.03 sec
subCircuit with size 2
Time =     0.05 sec
subCircuit with size 3
Time =     0.06 sec
subCircuit with size 4
Time =     0.10 sec
subCircuit with size 5
Time =     0.16 sec
subCircuit with size 6
Time =     0.49 sec
Success reduce subcircuit from 6 to 6
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    195  lev = 15
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    194  lev = 15
abc 884> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter67.aig
abc 884> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.07 sec
subCircuit with size 3
Time =     0.09 sec
subCircuit with size 4
Time =     0.13 sec
subCircuit with size 5
Time =     1.78 sec
subCircuit with size 6
Time =    10.99 sec
subCircuit with size 7
Time =    21.44 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    194  lev = 15
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    193  lev = 15
abc 896> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter68.aig
abc 896> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.07 sec
subCircuit with size 2
Time =     0.12 sec
subCircuit with size 3
Time =     0.15 sec
subCircuit with size 4
Time =     0.23 sec
subCircuit with size 5
Time =     0.29 sec
subCircuit with size 6
Time =     4.99 sec
subCircuit with size 7
Time =    18.54 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    193  lev = 15
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    193  lev = 15
abc 908> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter69.aig
abc 908> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.05 sec
subCircuit with size 2
Time =     0.09 sec
subCircuit with size 3
Time =     0.10 sec
subCircuit with size 4
Time =     0.18 sec
subCircuit with size 5
Time =     2.74 sec
subCircuit with size 6
Time =    11.21 sec
subCircuit with size 7
Time =    12.54 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    193  lev = 15
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    190  lev = 15
abc 920> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter70.aig
abc 920> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.02 sec
subCircuit with size 2
Time =     0.06 sec
subCircuit with size 3
Time =     0.41 sec
subCircuit with size 4
Time =     1.92 sec
subCircuit with size 5
Time =     6.16 sec
Success reduce subcircuit from 7 to 5
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    188  lev = 15
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    185  lev = 15
abc 932> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter71.aig
abc 932> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.11 sec
subCircuit with size 3
Time =     0.40 sec
subCircuit with size 4
Time =     1.64 sec
subCircuit with size 5
Time =    14.70 sec
subCircuit with size 6
Time =    15.51 sec
Success reduce subcircuit from 7 to 6
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    184  lev = 15
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    184  lev = 15
abc 944> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter72.aig
abc 944> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.03 sec
subCircuit with size 2
Time =     0.05 sec
subCircuit with size 3
Time =     0.06 sec
subCircuit with size 4
Time =     0.15 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    184  lev = 15
[1;37mex                            :[0m i/o =   10/   14  lat =    0  and =    184  lev = 15
abc 956> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex10.truth/iter73.aig
abc 956> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.04 sec
subCircuit with size 2
Time =     0.15 sec
subCircuit with size 3
Time =     0.32 sec
subCircuit with size 4
Time =     1.28 sec
subCircuit with size 5
Time =     3.81 sec
subCircuit with size 6
Time =    17.58 sec
subCircuit with size 7
