UC Berkeley, ABC 1.01 (compiled Dec  1 2023 18:58:55)
================== Command history ==================
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex00.truth
resyn
resyn2
resyn3
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex00.truth/iter0.aig
source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex00.truth/iter1.aig
source -s abc.rc
read_truth -xf ../../IWLS/benchmarks/ex00.truth 
cec -n lsv/finalProject/experiment/results/ex00.truth/iter0.aig 
=====================================================
abc 01> read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex01.truth
abc 02> resyn
abc 05> resyn2
abc 09> resyn3
abc 13> resyn
abc 16> resyn2
abc 20> resyn3
abc 24> resyn
abc 27> resyn2
abc 31> resyn3
abc 35> resyn
abc 38> resyn2
abc 42> resyn3
abc 46> resyn
abc 49> resyn2
abc 53> resyn3
abc 57> resyn
abc 60> resyn2
abc 64> resyn3
abc 68> ps
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1037  lev = 18
abc 68> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.41 sec
subCircuit with size 2
Time =     0.61 sec
subCircuit with size 3
Time =     0.81 sec
subCircuit with size 4
Time =     2.38 sec
subCircuit with size 5
Time =    13.82 sec
subCircuit with size 6
Time =    24.90 sec
Success reduce subcircuit from 6 to 6
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1037  lev = 18
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1037  lev = 18
abc 80> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter0.aig
abc 80> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.53 sec
subCircuit with size 2
Time =     1.75 sec
subCircuit with size 3
Time =     6.06 sec
subCircuit with size 4
Time =    47.24 sec
subCircuit with size 5
Time =   170.34 sec
subCircuit with size 6
Time =   108.70 sec
subCircuit with size 7
Time =   107.30 sec
subCircuit with size 1
Time =     0.43 sec
subCircuit with size 2
Time =     0.68 sec
subCircuit with size 3
Time =     0.92 sec
subCircuit with size 4
Time =     3.73 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1037  lev = 18
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1037  lev = 18
abc 92> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter1.aig
abc 92> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     1.38 sec
subCircuit with size 2
Time =     2.60 sec
subCircuit with size 3
Time =     7.29 sec
subCircuit with size 4
Time =    47.20 sec
subCircuit with size 5
Time =   104.14 sec
subCircuit with size 6
Time =   104.75 sec
subCircuit with size 7
Time =   105.28 sec
subCircuit with size 1
Time =     0.68 sec
subCircuit with size 2
Time =     2.54 sec
subCircuit with size 3
Time =    11.35 sec
subCircuit with size 4
Time =    63.12 sec
subCircuit with size 5
Time =   107.16 sec
subCircuit with size 6
Time =   113.28 sec
subCircuit with size 7
Time =   112.37 sec
subCircuit with size 1
Time =     0.65 sec
subCircuit with size 2
Time =     0.96 sec
subCircuit with size 3
Time =     4.66 sec
subCircuit with size 4
Time =    30.73 sec
subCircuit with size 5
Time =   121.56 sec
subCircuit with size 6
Time =   125.53 sec
subCircuit with size 7
Time =   136.79 sec
subCircuit with size 1
Time =     1.47 sec
subCircuit with size 2
Time =     7.16 sec
subCircuit with size 3
Time =    25.35 sec
subCircuit with size 4
Time =   131.42 sec
subCircuit with size 5
Time =   134.92 sec
subCircuit with size 6
Time =   106.63 sec
subCircuit with size 7
Time =   105.28 sec
subCircuit with size 1
Time =     0.52 sec
subCircuit with size 2
Time =     1.41 sec
subCircuit with size 3
Time =     1.72 sec
subCircuit with size 4
Time =     3.15 sec
subCircuit with size 5
Time =    38.39 sec
subCircuit with size 6
Time =   121.05 sec
subCircuit with size 7
Time =   116.37 sec
subCircuit with size 1
Time =     0.60 sec
subCircuit with size 2
Time =     2.91 sec
subCircuit with size 3
Time =    11.35 sec
subCircuit with size 4
Time =    52.43 sec
subCircuit with size 5
Time =   112.49 sec
subCircuit with size 6
Time =   105.66 sec
subCircuit with size 7
Time =   105.28 sec
subCircuit with size 1
Time =     0.31 sec
subCircuit with size 2
Time =     0.74 sec
subCircuit with size 3
Time =     3.54 sec
subCircuit with size 4
Time =    23.47 sec
subCircuit with size 5
Time =    96.08 sec
subCircuit with size 6
Time =   106.59 sec
subCircuit with size 7
Time =   104.81 sec
subCircuit with size 1
Time =     0.51 sec
subCircuit with size 2
Time =     1.09 sec
subCircuit with size 3
Time =     2.98 sec
subCircuit with size 4
Time =    25.71 sec
subCircuit with size 5
Time =    91.35 sec
subCircuit with size 6
Time =    78.04 sec
Success reduce subcircuit from 7 to 6
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1035  lev = 18
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1035  lev = 18
abc 104> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter2.aig
abc 104> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.76 sec
subCircuit with size 2
Time =     1.78 sec
subCircuit with size 3
Time =     8.45 sec
subCircuit with size 4
Time =    22.72 sec
subCircuit with size 5
Time =    41.83 sec
Success reduce subcircuit from 7 to 5
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1033  lev = 18
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1033  lev = 18
abc 116> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter3.aig
abc 116> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.59 sec
subCircuit with size 2
Time =     2.05 sec
subCircuit with size 3
Time =     9.68 sec
subCircuit with size 4
Time =    35.24 sec
subCircuit with size 5
Time =   103.43 sec
subCircuit with size 6
Time =   105.86 sec
subCircuit with size 7
Time =   105.95 sec
subCircuit with size 1
Time =     0.44 sec
subCircuit with size 2
Time =     0.72 sec
subCircuit with size 3
Time =     2.34 sec
subCircuit with size 4
Time =     5.82 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1033  lev = 18
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1033  lev = 18
abc 128> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter4.aig
abc 128> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.50 sec
subCircuit with size 2
Time =     2.18 sec
subCircuit with size 3
Time =    11.38 sec
subCircuit with size 4
Time =    97.70 sec
subCircuit with size 5
Time =   108.02 sec
subCircuit with size 6
Time =   113.44 sec
subCircuit with size 7
Time =   110.68 sec
subCircuit with size 1
Time =     0.65 sec
subCircuit with size 2
Time =     1.67 sec
subCircuit with size 3
Time =     5.33 sec
subCircuit with size 4
Time =    16.73 sec
subCircuit with size 5
Time =   107.05 sec
subCircuit with size 6
Time =   103.80 sec
subCircuit with size 7
Time =   105.98 sec
subCircuit with size 1
Time =     0.52 sec
subCircuit with size 2
Time =     1.75 sec
subCircuit with size 3
Time =     6.97 sec
subCircuit with size 4
Time =    39.30 sec
subCircuit with size 5
Time =   117.49 sec
subCircuit with size 6
Time =   113.15 sec
subCircuit with size 7
Time =   107.67 sec
subCircuit with size 1
Time =     0.49 sec
subCircuit with size 2
Time =     1.54 sec
subCircuit with size 3
Time =     4.06 sec
subCircuit with size 4
Time =    23.70 sec
subCircuit with size 5
Time =   102.94 sec
subCircuit with size 6
Time =   136.40 sec
subCircuit with size 7
Time =   106.12 sec
subCircuit with size 1
Time =     0.50 sec
subCircuit with size 2
Time =     2.54 sec
subCircuit with size 3
Time =    11.50 sec
subCircuit with size 4
Time =    45.80 sec
subCircuit with size 5
Time =   105.50 sec
subCircuit with size 6
Time =   105.92 sec
subCircuit with size 7
Time =   115.11 sec
subCircuit with size 1
Time =     0.36 sec
subCircuit with size 2
Time =     3.10 sec
subCircuit with size 3
Time =     2.98 sec
subCircuit with size 4
Time =    13.77 sec
subCircuit with size 5
Time =    58.73 sec
subCircuit with size 6
Time =   137.34 sec
subCircuit with size 7
Time =   108.90 sec
subCircuit with size 1
Time =     0.31 sec
subCircuit with size 2
Time =     1.36 sec
subCircuit with size 3
Time =     5.74 sec
subCircuit with size 4
Time =    24.83 sec
subCircuit with size 5
Time =   103.31 sec
subCircuit with size 6
Time =   113.57 sec
subCircuit with size 7
Time =   110.42 sec
subCircuit with size 1
Time =     0.34 sec
subCircuit with size 2
Time =     1.07 sec
subCircuit with size 3
Time =     5.37 sec
subCircuit with size 4
Time =    19.39 sec
subCircuit with size 5
Time =   108.11 sec
subCircuit with size 6
Time =   109.25 sec
subCircuit with size 7
Time =   105.41 sec
subCircuit with size 1
Time =     0.51 sec
subCircuit with size 2
Time =     1.35 sec
subCircuit with size 3
Time =     9.08 sec
subCircuit with size 4
Time =    20.18 sec
subCircuit with size 5
Time =   160.68 sec
subCircuit with size 6
Time =   108.39 sec
subCircuit with size 7
Time =   107.95 sec
subCircuit with size 1
Time =     0.74 sec
subCircuit with size 2
Time =     2.35 sec
subCircuit with size 3
Time =     4.88 sec
subCircuit with size 4
Time =    25.13 sec
subCircuit with size 5
Time =   103.12 sec
subCircuit with size 6
Time =   123.02 sec
subCircuit with size 7
Time =   109.25 sec
subCircuit with size 1
Time =     1.04 sec
subCircuit with size 2
Time =     4.48 sec
subCircuit with size 3
Time =    19.29 sec
subCircuit with size 4
Time =    33.72 sec
subCircuit with size 5
Time =   102.94 sec
subCircuit with size 6
Time =   112.30 sec
subCircuit with size 7
Time =   108.31 sec
subCircuit with size 1
Time =     1.42 sec
subCircuit with size 2
Time =     5.66 sec
subCircuit with size 3
Time =    19.29 sec
subCircuit with size 4
Time =    77.59 sec
subCircuit with size 5
Time =   105.69 sec
subCircuit with size 6
Time =   113.84 sec
subCircuit with size 7
Time =   115.98 sec
subCircuit with size 1
Time =     0.57 sec
subCircuit with size 2
Time =     1.04 sec
subCircuit with size 3
Time =     1.31 sec
subCircuit with size 4
Time =     7.90 sec
subCircuit with size 5
Time =    48.83 sec
subCircuit with size 6
Time =    92.06 sec
Success reduce subcircuit from 6 to 6
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1033  lev = 18
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1033  lev = 18
abc 140> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter5.aig
abc 140> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.54 sec
subCircuit with size 2
Time =     0.77 sec
subCircuit with size 3
Time =     1.08 sec
subCircuit with size 4
Time =     4.97 sec
subCircuit with size 5
Time =    28.12 sec
subCircuit with size 6
Time =   106.11 sec
subCircuit with size 1
Time =     0.45 sec
subCircuit with size 2
Time =     1.96 sec
subCircuit with size 3
Time =     7.11 sec
subCircuit with size 4
Time =    27.93 sec
subCircuit with size 5
Time =   142.58 sec
subCircuit with size 6
Time =   110.56 sec
subCircuit with size 7
Time =   109.49 sec
subCircuit with size 1
Time =     1.21 sec
subCircuit with size 2
Time =     1.95 sec
subCircuit with size 3
Time =     2.62 sec
subCircuit with size 4
Time =    28.53 sec
subCircuit with size 5
Time =   106.97 sec
subCircuit with size 6
Time =   109.09 sec
subCircuit with size 7
Time =   104.12 sec
subCircuit with size 1
Time =     0.39 sec
subCircuit with size 2
Time =     1.85 sec
subCircuit with size 3
Time =     5.98 sec
subCircuit with size 4
Time =    25.87 sec
subCircuit with size 5
Time =   113.31 sec
subCircuit with size 6
Time =   101.55 sec
Success reduce subcircuit from 7 to 6
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1032  lev = 18
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1032  lev = 18
abc 152> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter6.aig
abc 152> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.51 sec
subCircuit with size 2
Time =     0.97 sec
subCircuit with size 3
Time =     2.48 sec
subCircuit with size 4
Time =    13.01 sec
subCircuit with size 5
Time =    57.38 sec
subCircuit with size 6
Time =   113.78 sec
subCircuit with size 7
Time =   104.46 sec
subCircuit with size 1
Time =     0.29 sec
subCircuit with size 2
Time =     0.61 sec
subCircuit with size 3
Time =     4.55 sec
subCircuit with size 4
Time =    11.69 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1032  lev = 18
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1032  lev = 18
abc 164> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter7.aig
abc 164> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.76 sec
subCircuit with size 2
Time =     4.63 sec
subCircuit with size 3
Time =    10.64 sec
subCircuit with size 4
Time =    84.05 sec
subCircuit with size 5
Time =   105.23 sec
subCircuit with size 6
Time =   107.27 sec
subCircuit with size 7
Time =   106.63 sec
subCircuit with size 1
Time =     0.29 sec
subCircuit with size 2
Time =     0.74 sec
subCircuit with size 3
Time =     2.63 sec
subCircuit with size 4
Time =    19.23 sec
subCircuit with size 5
Time =    91.75 sec
subCircuit with size 6
Time =   102.75 sec
subCircuit with size 1
Time =     0.49 sec
subCircuit with size 2
Time =     2.13 sec
subCircuit with size 3
Time =     8.48 sec
subCircuit with size 4
Time =    38.91 sec
subCircuit with size 5
Time =   117.69 sec
subCircuit with size 6
Time =   104.28 sec
subCircuit with size 7
Time =   105.41 sec
subCircuit with size 1
Time =     0.31 sec
subCircuit with size 2
Time =     1.69 sec
subCircuit with size 3
Time =    11.66 sec
subCircuit with size 4
Time =    38.00 sec
subCircuit with size 5
Time =   103.15 sec
subCircuit with size 6
Time =   103.96 sec
subCircuit with size 7
Time =   105.99 sec
subCircuit with size 1
Time =     0.23 sec
subCircuit with size 2
Time =     0.49 sec
subCircuit with size 3
Time =     2.99 sec
subCircuit with size 4
Time =     6.29 sec
subCircuit with size 5
Time =    34.23 sec
subCircuit with size 6
Time =   101.55 sec
subCircuit with size 7
Time =   106.47 sec
subCircuit with size 1
Time =     0.58 sec
subCircuit with size 2
Time =     1.01 sec
subCircuit with size 3
Time =     1.49 sec
subCircuit with size 4
Time =     1.91 sec
subCircuit with size 5
Time =     3.15 sec
subCircuit with size 6
Time =    55.14 sec
subCircuit with size 7
Time =   106.49 sec
subCircuit with size 1
Time =     0.32 sec
subCircuit with size 2
Time =     0.43 sec
subCircuit with size 3
Time =     1.49 sec
subCircuit with size 4
Time =     4.35 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1032  lev = 18
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1032  lev = 18
abc 176> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter8.aig
abc 176> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.73 sec
subCircuit with size 2
Time =     0.90 sec
subCircuit with size 3
Time =     1.27 sec
subCircuit with size 4
Time =     9.48 sec
subCircuit with size 5
Time =    73.91 sec
subCircuit with size 6
Time =   116.91 sec
subCircuit with size 7
Time =   106.39 sec
subCircuit with size 1
Time =     0.23 sec
subCircuit with size 2
Time =     0.47 sec
subCircuit with size 3
Time =     0.78 sec
subCircuit with size 4
Time =     1.96 sec
subCircuit with size 5
Time =    25.70 sec
subCircuit with size 6
Time =   112.29 sec
subCircuit with size 7
Time =   103.95 sec
subCircuit with size 1
Time =     0.76 sec
subCircuit with size 2
Time =     1.60 sec
subCircuit with size 3
Time =     2.51 sec
subCircuit with size 4
Time =     3.38 sec
subCircuit with size 5
Time =    56.91 sec
subCircuit with size 6
Time =   112.98 sec
subCircuit with size 7
Time =   106.52 sec
subCircuit with size 1
Time =     0.34 sec
subCircuit with size 2
Time =     3.04 sec
subCircuit with size 3
Time =     5.24 sec
subCircuit with size 4
Time =    20.43 sec
subCircuit with size 5
Time =    18.97 sec
Success reduce subcircuit from 7 to 5
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1030  lev = 18
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1025  lev = 18
abc 188> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter9.aig
abc 188> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.53 sec
subCircuit with size 2
Time =     0.79 sec
subCircuit with size 3
Time =     3.16 sec
subCircuit with size 4
Time =     4.98 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1025  lev = 18
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1024  lev = 18
abc 200> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter10.aig
abc 200> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.69 sec
subCircuit with size 2
Time =     2.71 sec
subCircuit with size 3
Time =    10.45 sec
subCircuit with size 4
Time =    32.65 sec
subCircuit with size 5
Time =   108.03 sec
subCircuit with size 6
Time =   111.86 sec
subCircuit with size 7
Time =   116.23 sec
subCircuit with size 1
Time =     0.54 sec
subCircuit with size 2
Time =     1.10 sec
subCircuit with size 3
Time =     2.58 sec
subCircuit with size 4
Time =     2.06 sec
subCircuit with size 5
Time =    19.91 sec
subCircuit with size 6
Time =   105.03 sec
subCircuit with size 7
Time =   109.64 sec
subCircuit with size 1
Time =     0.25 sec
subCircuit with size 2
Time =     0.47 sec
subCircuit with size 3
Time =     1.33 sec
subCircuit with size 4
Time =     1.39 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1024  lev = 18
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =   1024  lev = 18
abc 212> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter11.aig
abc 212> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.60 sec
subCircuit with size 2
Time =     0.76 sec
subCircuit with size 3
Time =     0.99 sec
subCircuit with size 4
Time =     7.26 sec
subCircuit with size 5
Time =    22.24 sec
subCircuit with size 6
Time =   127.50 sec
subCircuit with size 7
Time =   111.74 sec
subCircuit with size 1
Time =     0.56 sec
subCircuit with size 2
Time =     3.56 sec
subCircuit with size 3
Time =    15.50 sec
subCircuit with size 4
Time =    48.00 sec
subCircuit with size 5
Time =   108.65 sec
subCircuit with size 6
Time =   113.28 sec
subCircuit with size 7
Time =   109.29 sec
subCircuit with size 1
Time =     0.72 sec
subCircuit with size 2
Time =     1.44 sec
subCircuit with size 3
Time =     1.87 sec
subCircuit with size 4
Time =     2.67 sec
subCircuit with size 5
Time =    17.95 sec
subCircuit with size 6
Time =    77.33 sec
subCircuit with size 7
