UC Berkeley, ABC 1.01 (compiled Dec  1 2023 18:58:55)
================== Command history ==================
cec -n lsv/finalProject/experiment/results/ex00.truth/iter0.aig 
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex01.truth
resyn
resyn2
resyn3
source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter0.aig
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex03.truth
source -s abc.rc
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex04.truth
=====================================================
abc 01> read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex05.truth
abc 02> resyn
abc 05> resyn2
abc 09> resyn3
abc 13> resyn
abc 16> resyn2
abc 20> resyn3
abc 24> resyn
abc 27> resyn2
abc 31> resyn3
abc 35> resyn
abc 38> resyn2
abc 42> resyn3
abc 46> resyn
abc 49> resyn2
abc 53> resyn3
abc 57> resyn
abc 60> resyn2
abc 64> resyn3
abc 68> ps
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3197  lev = 21
abc 68> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.72 sec
subCircuit with size 2
Time =     1.18 sec
subCircuit with size 3
Time =     1.41 sec
subCircuit with size 4
Time =    10.05 sec
subCircuit with size 5
Time =    68.94 sec
subCircuit with size 6
Time =   103.95 sec
subCircuit with size 7
Time =   108.88 sec
subCircuit with size 1
Time =     0.79 sec
subCircuit with size 2
Time =     1.21 sec
subCircuit with size 3
Time =     1.59 sec
subCircuit with size 4
Time =     5.55 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3197  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3197  lev = 21
abc 80> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter0.aig
abc 80> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     1.11 sec
subCircuit with size 2
Time =     1.96 sec
subCircuit with size 3
Time =    10.33 sec
subCircuit with size 4
Time =    37.36 sec
subCircuit with size 5
Time =   108.15 sec
subCircuit with size 6
Time =   114.06 sec
subCircuit with size 7
Time =   105.60 sec
subCircuit with size 1
Time =     0.87 sec
subCircuit with size 2
Time =     1.45 sec
subCircuit with size 3
Time =     1.98 sec
subCircuit with size 4
Time =     2.39 sec
subCircuit with size 5
Time =    18.49 sec
subCircuit with size 6
Time =   105.01 sec
subCircuit with size 7
Time =   105.52 sec
subCircuit with size 1
Time =     1.28 sec
subCircuit with size 2
Time =     1.88 sec
subCircuit with size 3
Time =     2.11 sec
subCircuit with size 4
Time =     5.65 sec
subCircuit with size 5
Time =    17.70 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3197  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3197  lev = 21
abc 92> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter1.aig
abc 92> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     1.07 sec
subCircuit with size 2
Time =     2.22 sec
subCircuit with size 3
Time =     9.93 sec
subCircuit with size 4
Time =    31.83 sec
subCircuit with size 5
Time =   165.52 sec
subCircuit with size 6
Time =   104.35 sec
subCircuit with size 7
Time =   106.13 sec
subCircuit with size 1
Time =     0.84 sec
subCircuit with size 2
Time =     1.88 sec
subCircuit with size 3
Time =     9.50 sec
subCircuit with size 4
Time =    26.93 sec
subCircuit with size 5
Time =   105.15 sec
subCircuit with size 6
Time =   127.17 sec
subCircuit with size 7
Time =   105.92 sec
subCircuit with size 1
Time =     0.50 sec
subCircuit with size 2
Time =     2.02 sec
subCircuit with size 3
Time =     8.31 sec
subCircuit with size 4
Time =    52.01 sec
subCircuit with size 5
Time =   107.31 sec
subCircuit with size 6
Time =   106.72 sec
subCircuit with size 7
Time =   110.87 sec
subCircuit with size 1
Time =     0.96 sec
subCircuit with size 2
Time =     2.23 sec
subCircuit with size 3
Time =     8.41 sec
subCircuit with size 4
Time =    36.04 sec
subCircuit with size 5
Time =   130.62 sec
subCircuit with size 6
Time =   103.97 sec
subCircuit with size 7
Time =   104.50 sec
subCircuit with size 1
Time =     0.46 sec
subCircuit with size 2
Time =     2.12 sec
subCircuit with size 3
Time =    11.41 sec
subCircuit with size 4
Time =    41.32 sec
subCircuit with size 5
Time =   108.14 sec
subCircuit with size 6
Time =   106.78 sec
subCircuit with size 7
Time =   107.19 sec
subCircuit with size 1
Time =     1.97 sec
subCircuit with size 2
Time =     2.86 sec
subCircuit with size 3
Time =     3.95 sec
subCircuit with size 4
Time =     3.22 sec
subCircuit with size 5
Time =     3.76 sec
subCircuit with size 6
Time =   103.62 sec
subCircuit with size 7
Time =   110.30 sec
subCircuit with size 1
Time =     1.19 sec
subCircuit with size 2
Time =     1.91 sec
subCircuit with size 3
Time =     2.35 sec
subCircuit with size 4
Time =     6.00 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3197  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3197  lev = 21
abc 104> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter2.aig
abc 104> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.64 sec
subCircuit with size 2
Time =     2.25 sec
subCircuit with size 3
Time =     4.28 sec
subCircuit with size 4
Time =    14.78 sec
subCircuit with size 5
Time =   104.19 sec
subCircuit with size 6
Time =   106.42 sec
subCircuit with size 7
Time =   107.33 sec
subCircuit with size 1
Time =     0.69 sec
subCircuit with size 2
Time =     1.84 sec
subCircuit with size 3
Time =     6.98 sec
subCircuit with size 4
Time =    24.55 sec
subCircuit with size 5
Time =    99.68 sec
Success reduce subcircuit from 7 to 5
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3195  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3195  lev = 21
abc 116> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter3.aig
abc 116> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     1.92 sec
subCircuit with size 2
Time =     3.22 sec
subCircuit with size 3
Time =     2.80 sec
subCircuit with size 4
Time =     3.69 sec
subCircuit with size 5
Time =     4.64 sec
subCircuit with size 6
Time =   117.58 sec
subCircuit with size 7
Time =   110.90 sec
subCircuit with size 1
Time =     1.00 sec
subCircuit with size 2
Time =     0.85 sec
subCircuit with size 3
Time =     1.07 sec
subCircuit with size 4
Time =     1.56 sec
subCircuit with size 5
Time =     4.74 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3195  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3195  lev = 21
abc 128> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter4.aig
abc 128> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.86 sec
subCircuit with size 2
Time =     1.00 sec
subCircuit with size 3
Time =     1.27 sec
subCircuit with size 4
Time =     5.80 sec
subCircuit with size 5
Time =   111.13 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3195  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3195  lev = 21
abc 140> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter5.aig
abc 140> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.60 sec
subCircuit with size 2
Time =     1.09 sec
Success reduce subcircuit from 7 to 2
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3190  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3189  lev = 21
abc 152> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter6.aig
abc 152> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.49 sec
subCircuit with size 2
Time =     2.30 sec
subCircuit with size 3
Time =     6.64 sec
subCircuit with size 4
Time =    38.97 sec
subCircuit with size 5
Time =    76.53 sec
Success reduce subcircuit from 7 to 5
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
abc 164> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter7.aig
abc 164> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     1.70 sec
subCircuit with size 2
Time =     3.14 sec
subCircuit with size 3
Time =     2.19 sec
subCircuit with size 4
Time =     7.96 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
abc 176> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter8.aig
abc 176> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.74 sec
subCircuit with size 2
Time =     1.65 sec
subCircuit with size 3
Time =     5.66 sec
subCircuit with size 4
Time =    33.04 sec
subCircuit with size 5
Time =    99.23 sec
subCircuit with size 6
Time =   124.27 sec
subCircuit with size 7
Time =   105.04 sec
subCircuit with size 1
Time =     1.18 sec
subCircuit with size 2
Time =     1.78 sec
subCircuit with size 3
Time =     4.13 sec
subCircuit with size 4
Time =    28.74 sec
subCircuit with size 5
Time =    44.80 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
abc 188> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter9.aig
abc 188> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     1.23 sec
subCircuit with size 2
Time =     1.41 sec
subCircuit with size 3
Time =     1.59 sec
subCircuit with size 4
Time =     1.92 sec
subCircuit with size 5
Time =     2.51 sec
subCircuit with size 6
Time =    34.73 sec
subCircuit with size 7
Time =    20.04 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
abc 200> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter10.aig
abc 200> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     1.23 sec
subCircuit with size 2
Time =     1.71 sec
subCircuit with size 3
Time =     4.75 sec
subCircuit with size 4
Time =    22.03 sec
subCircuit with size 5
Time =   103.32 sec
subCircuit with size 6
Time =   106.09 sec
subCircuit with size 7
Time =   107.24 sec
subCircuit with size 1
Time =     1.38 sec
subCircuit with size 2
Time =     2.39 sec
subCircuit with size 3
Time =     3.01 sec
subCircuit with size 4
Time =     4.17 sec
subCircuit with size 5
Time =     4.42 sec
subCircuit with size 6
Time =     8.48 sec
subCircuit with size 7
Time =   110.90 sec
subCircuit with size 1
Time =     0.48 sec
subCircuit with size 2
Time =     1.74 sec
subCircuit with size 3
Time =     6.44 sec
subCircuit with size 4
Time =    30.82 sec
subCircuit with size 5
Time =   105.11 sec
subCircuit with size 6
Time =   121.56 sec
subCircuit with size 7
Time =   105.92 sec
subCircuit with size 1
Time =     0.62 sec
subCircuit with size 2
Time =     3.18 sec
subCircuit with size 3
Time =    10.77 sec
subCircuit with size 4
Time =    38.51 sec
subCircuit with size 5
Time =   104.13 sec
subCircuit with size 6
Time =   111.89 sec
subCircuit with size 7
Time =   105.28 sec
subCircuit with size 1
Time =     0.60 sec
subCircuit with size 2
Time =     2.74 sec
subCircuit with size 3
Time =     9.07 sec
subCircuit with size 4
Time =    27.64 sec
subCircuit with size 5
Time =   107.19 sec
subCircuit with size 6
Time =   107.44 sec
subCircuit with size 7
Time =   108.51 sec
subCircuit with size 1
Time =     0.70 sec
subCircuit with size 2
Time =     1.59 sec
subCircuit with size 3
Time =     4.77 sec
subCircuit with size 4
Time =    20.69 sec
subCircuit with size 5
Time =   104.55 sec
subCircuit with size 6
Time =   109.08 sec
subCircuit with size 7
Time =   113.89 sec
subCircuit with size 1
Time =     0.92 sec
subCircuit with size 2
Time =     1.29 sec
subCircuit with size 3
Time =     1.60 sec
subCircuit with size 4
Time =     6.26 sec
subCircuit with size 5
Time =    22.56 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
abc 212> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter11.aig
abc 212> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.59 sec
subCircuit with size 2
Time =     1.44 sec
subCircuit with size 3
Time =     3.67 sec
subCircuit with size 4
Time =    15.79 sec
subCircuit with size 5
Time =   110.77 sec
subCircuit with size 6
Time =   106.09 sec
subCircuit with size 7
Time =   107.17 sec
subCircuit with size 1
Time =     0.60 sec
subCircuit with size 2
Time =     2.37 sec
subCircuit with size 3
Time =    10.37 sec
subCircuit with size 4
Time =    38.29 sec
subCircuit with size 5
Time =   108.02 sec
subCircuit with size 6
Time =   108.88 sec
subCircuit with size 7
Time =   107.52 sec
subCircuit with size 1
Time =     0.90 sec
subCircuit with size 2
Time =     1.75 sec
subCircuit with size 3
Time =     3.41 sec
subCircuit with size 4
Time =     7.28 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
abc 224> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter12.aig
abc 224> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.54 sec
subCircuit with size 2
Time =     1.77 sec
subCircuit with size 3
Time =     7.81 sec
subCircuit with size 4
Time =    27.13 sec
subCircuit with size 5
Time =   108.66 sec
subCircuit with size 6
Time =   105.79 sec
subCircuit with size 7
Time =   105.81 sec
subCircuit with size 1
Time =     0.73 sec
subCircuit with size 2
Time =     1.38 sec
subCircuit with size 3
Time =     1.60 sec
subCircuit with size 4
Time =     8.16 sec
subCircuit with size 5
Time =    35.84 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
abc 236> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter13.aig
abc 236> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.52 sec
subCircuit with size 2
Time =     1.62 sec
subCircuit with size 3
Time =     4.96 sec
subCircuit with size 4
Time =    35.12 sec
subCircuit with size 5
Time =    94.21 sec
subCircuit with size 6
Time =   104.21 sec
subCircuit with size 7
Time =   105.61 sec
subCircuit with size 1
Time =     0.57 sec
subCircuit with size 2
Time =     1.50 sec
subCircuit with size 3
Time =     5.85 sec
subCircuit with size 4
Time =    37.35 sec
subCircuit with size 5
Time =   103.54 sec
subCircuit with size 6
Time =   119.64 sec
subCircuit with size 7
Time =   128.03 sec
subCircuit with size 1
Time =     1.47 sec
subCircuit with size 2
Time =     3.43 sec
subCircuit with size 3
Time =    27.51 sec
subCircuit with size 4
Time =    66.09 sec
subCircuit with size 5
Time =   106.04 sec
subCircuit with size 6
Time =   105.67 sec
subCircuit with size 7
Time =   113.62 sec
subCircuit with size 1
Time =     0.87 sec
subCircuit with size 2
Time =     1.63 sec
subCircuit with size 3
Time =     5.09 sec
subCircuit with size 4
Time =    35.55 sec
subCircuit with size 5
Time =   131.86 sec
subCircuit with size 6
Time =   146.90 sec
subCircuit with size 7
Time =   110.05 sec
subCircuit with size 1
Time =     0.67 sec
subCircuit with size 2
Time =     1.22 sec
subCircuit with size 3
Time =     2.50 sec
subCircuit with size 4
Time =     3.52 sec
subCircuit with size 5
Time =     6.62 sec
subCircuit with size 6
Time =   121.86 sec
subCircuit with size 7
Time =   120.99 sec
subCircuit with size 1
Time =     1.26 sec
subCircuit with size 2
Time =     1.89 sec
subCircuit with size 3
Time =     2.41 sec
subCircuit with size 4
Time =     2.94 sec
subCircuit with size 5
Time =    26.26 sec
subCircuit with size 6
Time =   140.10 sec
subCircuit with size 7
Time =   104.92 sec
subCircuit with size 1
Time =     0.77 sec
subCircuit with size 2
Time =     1.27 sec
subCircuit with size 3
Time =     1.93 sec
subCircuit with size 4
Time =    14.55 sec
subCircuit with size 5
Time =   101.25 sec
subCircuit with size 6
Time =   106.70 sec
subCircuit with size 7
Time =   136.61 sec
subCircuit with size 1
Time =     0.46 sec
subCircuit with size 2
Time =     1.84 sec
subCircuit with size 3
Time =    10.13 sec
subCircuit with size 4
Time =    40.40 sec
subCircuit with size 5
Time =   127.05 sec
subCircuit with size 6
Time =   104.25 sec
subCircuit with size 7
Time =   107.75 sec
subCircuit with size 1
Time =     0.95 sec
subCircuit with size 2
Time =     1.70 sec
subCircuit with size 3
Time =     2.79 sec
subCircuit with size 4
Time =     3.47 sec
subCircuit with size 5
Time =    33.46 sec
subCircuit with size 6
Time =   108.08 sec
subCircuit with size 7
Time =   131.56 sec
subCircuit with size 1
Time =     0.61 sec
subCircuit with size 2
Time =     2.33 sec
subCircuit with size 3
Time =    11.29 sec
subCircuit with size 4
Time =    59.56 sec
subCircuit with size 5
Time =   103.50 sec
subCircuit with size 6
Time =   104.06 sec
subCircuit with size 7
Time =   105.26 sec
subCircuit with size 1
Time =     0.82 sec
subCircuit with size 2
Time =     1.45 sec
subCircuit with size 3
Time =     4.03 sec
subCircuit with size 4
Time =    14.00 sec
subCircuit with size 5
Time =    32.38 sec
subCircuit with size 6
Time =   103.97 sec
subCircuit with size 7
Time =   106.29 sec
subCircuit with size 1
Time =     0.41 sec
subCircuit with size 2
Time =     0.80 sec
subCircuit with size 3
Time =     3.96 sec
subCircuit with size 4
Time =    11.50 sec
subCircuit with size 5
Time =    58.30 sec
subCircuit with size 6
Time =   105.94 sec
subCircuit with size 7
Time =   106.75 sec
subCircuit with size 1
Time =     1.31 sec
subCircuit with size 2
Time =     2.10 sec
subCircuit with size 3
Time =     2.82 sec
subCircuit with size 4
Time =     4.07 sec
subCircuit with size 5
Time =     5.27 sec
subCircuit with size 6
Time =    45.88 sec
subCircuit with size 7
Time =   105.67 sec
Success reduce subcircuit from 7 to 7
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
[1;37mex                            :[0m i/o =   14/    6  lat =    0  and =   3187  lev = 21
abc 248> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex05.truth/iter14.aig
abc 248> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.67 sec
subCircuit with size 2
Time =     1.02 sec
subCircuit with size 3
Time =     4.61 sec
subCircuit with size 4
Time =    21.01 sec
subCircuit with size 5
Time =   102.76 sec
subCircuit with size 6
Time =   105.41 sec
subCircuit with size 7
Time =   104.31 sec
subCircuit with size 1
Time =     0.51 sec
subCircuit with size 2
Time =     2.59 sec
subCircuit with size 3
Time =     9.16 sec
subCircuit with size 4
Time =    40.34 sec
subCircuit with size 5
Time =   131.27 sec
subCircuit with size 6
Time =   114.29 sec
subCircuit with size 7
Time =   110.15 sec
subCircuit with size 1
Time =     0.28 sec
subCircuit with size 2
Time =     0.58 sec
subCircuit with size 3
Time =     3.18 sec
subCircuit with size 4
Time =     6.25 sec
subCircuit with size 5
Time =    31.60 sec
subCircuit with size 6
Time =   116.72 sec
subCircuit with size 7
Time =   108.37 sec
subCircuit with size 1
Time =     0.56 sec
subCircuit with size 2
Time =     1.53 sec
subCircuit with size 3
Time =     8.94 sec
subCircuit with size 4
Time =    33.56 sec
subCircuit with size 5
Time =   140.19 sec
subCircuit with size 6
Time =   109.75 sec
subCircuit with size 7
Time =   106.31 sec
subCircuit with size 1
Time =     0.47 sec
subCircuit with size 2
Time =     2.48 sec
subCircuit with size 3
Time =     9.65 sec
subCircuit with size 4
Time =    41.24 sec
subCircuit with size 5
Time =   112.77 sec
subCircuit with size 6
Time =   105.20 sec
subCircuit with size 7
Time =   105.46 sec
subCircuit with size 1
Time =     0.53 sec
subCircuit with size 2
Time =     2.20 sec
subCircuit with size 3
Time =     9.70 sec
subCircuit with size 4
Time =    47.65 sec
subCircuit with size 5
Time =   103.81 sec
subCircuit with size 6
Time =   115.47 sec
subCircuit with size 7
Time =   106.62 sec
subCircuit with size 1
Time =     0.45 sec
subCircuit with size 2
Time =     0.99 sec
subCircuit with size 3
Time =     3.45 sec
subCircuit with size 4
Time =    21.82 sec
subCircuit with size 5
