UC Berkeley, ABC 1.01 (compiled Dec  1 2023 18:58:55)
================== Command history ==================
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex04.truth/iter2.aig
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex07.truth
resyn
resyn2
resyn3
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex07.truth/iter0.aig
source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex07.truth/iter1.aig
source -s abc.rc
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex08.truth
=====================================================
abc 01> read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex09.truth
abc 02> resyn
abc 05> resyn2
abc 09> resyn3
abc 13> resyn
abc 16> resyn2
abc 20> resyn3
abc 24> resyn
abc 27> resyn2
abc 31> resyn3
abc 35> resyn
abc 38> resyn2
abc 42> resyn3
abc 46> resyn
abc 49> resyn2
abc 53> resyn3
abc 57> resyn
abc 60> resyn2
abc 64> resyn3
abc 68> ps
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4859  lev = 21
abc 68> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     6.14 sec
subCircuit with size 2
Time =     9.24 sec
subCircuit with size 3
Time =    12.24 sec
subCircuit with size 4
Time =    16.56 sec
subCircuit with size 5
Time =    42.60 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4859  lev = 21
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4858  lev = 21
abc 80> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex09.truth/iter0.aig
abc 80> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     2.15 sec
subCircuit with size 2
Time =     4.28 sec
subCircuit with size 3
Time =     7.25 sec
subCircuit with size 4
Time =    69.68 sec
subCircuit with size 5
Time =   115.08 sec
subCircuit with size 6
Time =   336.95 sec
subCircuit with size 7
Time =   127.51 sec
subCircuit with size 1
Time =     1.39 sec
subCircuit with size 2
Time =     7.70 sec
subCircuit with size 3
Time =    38.89 sec
subCircuit with size 4
Time =   192.69 sec
subCircuit with size 5
Time =   112.47 sec
subCircuit with size 6
Time =   117.23 sec
subCircuit with size 7
Time =   135.20 sec
subCircuit with size 1
Time =     7.17 sec
subCircuit with size 2
Time =     8.33 sec
subCircuit with size 3
Time =    10.11 sec
subCircuit with size 4
Time =    27.97 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4858  lev = 21
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4857  lev = 21
abc 92> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex09.truth/iter1.aig
abc 92> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     3.04 sec
subCircuit with size 2
Time =    11.27 sec
subCircuit with size 3
Time =    42.12 sec
subCircuit with size 4
Time =   171.08 sec
subCircuit with size 5
Time =   164.88 sec
subCircuit with size 6
Time =   120.33 sec
subCircuit with size 7
Time =   122.90 sec
subCircuit with size 1
Time =     3.39 sec
subCircuit with size 2
Time =     3.79 sec
subCircuit with size 3
Time =     6.67 sec
subCircuit with size 4
Time =    39.49 sec
subCircuit with size 5
Time =   134.13 sec
subCircuit with size 6
Time =   125.93 sec
subCircuit with size 7
Time =   123.08 sec
subCircuit with size 1
Time =     8.10 sec
subCircuit with size 2
Time =    10.72 sec
subCircuit with size 3
Time =    14.35 sec
subCircuit with size 4
Time =    19.13 sec
subCircuit with size 5
Time =    23.18 sec
subCircuit with size 6
Time =   180.73 sec
subCircuit with size 7
Time =   132.58 sec
subCircuit with size 1
Time =     7.53 sec
subCircuit with size 2
Time =     9.69 sec
subCircuit with size 3
Time =    11.90 sec
subCircuit with size 4
Time =    15.97 sec
subCircuit with size 5
Time =    26.62 sec
subCircuit with size 6
Time =   115.69 sec
subCircuit with size 7
Time =   138.62 sec
subCircuit with size 1
Time =     1.96 sec
subCircuit with size 2
Time =     7.00 sec
subCircuit with size 3
Time =    22.83 sec
subCircuit with size 4
Time =   118.01 sec
subCircuit with size 5
Time =   118.37 sec
subCircuit with size 6
Time =   119.58 sec
subCircuit with size 7
Time =   130.14 sec
subCircuit with size 1
Time =     1.82 sec
Success reduce subcircuit from 7 to 1
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4851  lev = 21
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4848  lev = 21
abc 104> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex09.truth/iter2.aig
abc 104> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     8.66 sec
subCircuit with size 2
Time =    12.38 sec
subCircuit with size 3
Time =    13.70 sec
subCircuit with size 4
Time =    17.13 sec
subCircuit with size 5
Time =    49.08 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4848  lev = 21
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4846  lev = 21
abc 116> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex09.truth/iter3.aig
abc 116> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     1.71 sec
subCircuit with size 2
Time =     3.38 sec
subCircuit with size 3
Time =    15.04 sec
subCircuit with size 4
Time =    84.22 sec
subCircuit with size 5
Time =   140.96 sec
subCircuit with size 6
Time =   466.70 sec
subCircuit with size 7
Time =   147.15 sec
subCircuit with size 1
Time =     4.70 sec
subCircuit with size 2
Time =    15.85 sec
subCircuit with size 3
Time =    48.20 sec
subCircuit with size 4
Time =   135.75 sec
subCircuit with size 5
Time =   142.70 sec
subCircuit with size 6
Time =   120.87 sec
subCircuit with size 7
Time =   125.80 sec
subCircuit with size 1
Time =    11.56 sec
subCircuit with size 2
Time =    16.72 sec
subCircuit with size 3
Time =    19.79 sec
subCircuit with size 4
Time =    17.56 sec
subCircuit with size 5
Time =    25.19 sec
subCircuit with size 6
Time =   138.25 sec
subCircuit with size 7
Time =   139.97 sec
subCircuit with size 1
Time =     3.03 sec
subCircuit with size 2
Time =     8.93 sec
subCircuit with size 3
Time =    26.65 sec
subCircuit with size 4
Time =    84.64 sec
subCircuit with size 5
Time =   160.96 sec
subCircuit with size 6
Time =   121.58 sec
subCircuit with size 7
Time =   128.13 sec
subCircuit with size 1
Time =     2.73 sec
subCircuit with size 2
Time =     9.48 sec
subCircuit with size 3
Time =    33.00 sec
subCircuit with size 4
Time =   115.46 sec
subCircuit with size 5
Time =   113.75 sec
subCircuit with size 6
Time =   117.04 sec
subCircuit with size 7
Time =   122.39 sec
subCircuit with size 1
Time =     1.26 sec
subCircuit with size 2
Time =     4.59 sec
subCircuit with size 3
Time =    10.69 sec
subCircuit with size 4
Time =    74.81 sec
subCircuit with size 5
Time =   192.33 sec
subCircuit with size 6
Time =   133.44 sec
subCircuit with size 7
Time =   121.01 sec
subCircuit with size 1
Time =     9.56 sec
subCircuit with size 2
Time =    14.31 sec
subCircuit with size 3
Time =    18.89 sec
subCircuit with size 4
Time =    22.72 sec
subCircuit with size 5
Time =   114.90 sec
subCircuit with size 6
Time =   125.08 sec
subCircuit with size 7
Time =   155.36 sec
subCircuit with size 1
Time =     4.10 sec
subCircuit with size 2
Time =     6.02 sec
subCircuit with size 3
Time =     7.99 sec
subCircuit with size 4
Time =    13.11 sec
subCircuit with size 5
Time =   142.56 sec
subCircuit with size 6
Time =   130.38 sec
subCircuit with size 7
Time =   126.97 sec
subCircuit with size 1
Time =     9.16 sec
subCircuit with size 2
Time =    12.56 sec
subCircuit with size 3
Time =    14.67 sec
subCircuit with size 4
Time =    20.27 sec
subCircuit with size 5
Time =    27.33 sec
subCircuit with size 6
Time =    34.64 sec
subCircuit with size 7
Time =   150.94 sec
subCircuit with size 1
Time =     4.95 sec
subCircuit with size 2
Time =     7.81 sec
subCircuit with size 3
Time =    22.31 sec
subCircuit with size 4
Time =    85.14 sec
subCircuit with size 5
Time =   152.56 sec
subCircuit with size 6
Time =   156.10 sec
subCircuit with size 7
Time =   127.77 sec
subCircuit with size 1
Time =     2.28 sec
Success reduce subcircuit from 7 to 1
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4839  lev = 21
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4839  lev = 21
abc 128> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex09.truth/iter4.aig
abc 128> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     6.36 sec
subCircuit with size 2
Time =     8.51 sec
subCircuit with size 3
Time =    10.15 sec
subCircuit with size 4
Time =    24.33 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4839  lev = 21
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4839  lev = 21
abc 140> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex09.truth/iter5.aig
abc 140> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     8.62 sec
subCircuit with size 2
Time =    11.54 sec
subCircuit with size 3
Time =    12.27 sec
subCircuit with size 4
Time =    16.12 sec
subCircuit with size 5
Time =    63.75 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4839  lev = 21
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4839  lev = 21
abc 152> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex09.truth/iter6.aig
abc 152> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =    11.40 sec
subCircuit with size 2
Time =    18.06 sec
subCircuit with size 3
Time =    23.00 sec
subCircuit with size 4
Time =    31.39 sec
subCircuit with size 5
Time =   242.49 sec
subCircuit with size 6
Time =   122.15 sec
subCircuit with size 7
Time =   127.29 sec
subCircuit with size 1
Time =     1.91 sec
subCircuit with size 2
Time =     8.65 sec
subCircuit with size 3
Time =    41.13 sec
subCircuit with size 4
Time =   144.66 sec
subCircuit with size 5
Time =   122.84 sec
subCircuit with size 6
Time =   124.15 sec
subCircuit with size 7
Time =   126.30 sec
subCircuit with size 1
Time =     5.59 sec
subCircuit with size 2
Time =     8.24 sec
subCircuit with size 3
Time =    11.01 sec
subCircuit with size 4
Time =    13.82 sec
subCircuit with size 5
Time =    19.74 sec
subCircuit with size 6
Time =    37.45 sec
subCircuit with size 7
Time =   135.29 sec
subCircuit with size 1
Time =    12.99 sec
subCircuit with size 2
Time =    19.70 sec
subCircuit with size 3
Time =    22.99 sec
subCircuit with size 4
Time =    29.37 sec
subCircuit with size 5
Time =   136.72 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4839  lev = 21
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4839  lev = 21
abc 164> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex09.truth/iter7.aig
abc 164> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =    11.49 sec
subCircuit with size 2
Time =    16.54 sec
subCircuit with size 3
Time =    20.29 sec
subCircuit with size 4
Time =    80.41 sec
subCircuit with size 5
Time =   116.81 sec
subCircuit with size 1
Time =     7.19 sec
subCircuit with size 2
Time =    12.11 sec
subCircuit with size 3
Time =    11.70 sec
subCircuit with size 4
Time =    14.37 sec
subCircuit with size 5
Time =    18.55 sec
subCircuit with size 6
Time =    30.93 sec
subCircuit with size 7
Time =   125.73 sec
subCircuit with size 1
Time =     7.28 sec
subCircuit with size 2
Time =     9.58 sec
subCircuit with size 3
Time =    11.40 sec
subCircuit with size 4
Time =    23.19 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4839  lev = 21
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4839  lev = 21
abc 176> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex09.truth/iter8.aig
abc 176> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     1.71 sec
subCircuit with size 2
Time =     5.84 sec
subCircuit with size 3
Time =    19.94 sec
Success reduce subcircuit from 7 to 3
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4835  lev = 21
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4835  lev = 21
abc 188> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex09.truth/iter9.aig
abc 188> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     1.72 sec
subCircuit with size 2
Time =     6.99 sec
subCircuit with size 3
Time =    31.20 sec
subCircuit with size 4
Time =    92.35 sec
subCircuit with size 5
Time =   118.63 sec
subCircuit with size 6
Time =   118.49 sec
subCircuit with size 7
Time =   134.40 sec
subCircuit with size 1
Time =    13.79 sec
subCircuit with size 2
Time =    18.69 sec
subCircuit with size 3
Time =    21.37 sec
subCircuit with size 4
Time =    57.71 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4835  lev = 21
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4834  lev = 21
abc 200> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex09.truth/iter10.aig
abc 200> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =    22.07 sec
subCircuit with size 2
Time =    30.82 sec
subCircuit with size 3
Time =    36.15 sec
subCircuit with size 4
Time =    42.74 sec
subCircuit with size 5
Time =    29.86 sec
subCircuit with size 6
Time =   125.22 sec
subCircuit with size 1
Time =     1.83 sec
subCircuit with size 2
Time =     8.52 sec
subCircuit with size 3
Time =    45.27 sec
subCircuit with size 4
Time =   150.62 sec
subCircuit with size 5
Time =   128.83 sec
subCircuit with size 6
Time =   117.25 sec
subCircuit with size 7
Time =   121.91 sec
subCircuit with size 1
Time =     3.50 sec
subCircuit with size 2
Time =     3.89 sec
subCircuit with size 3
Time =     5.29 sec
subCircuit with size 4
Time =    76.78 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4834  lev = 21
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4834  lev = 21
abc 212> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex09.truth/iter11.aig
abc 212> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     8.14 sec
subCircuit with size 2
Time =    11.81 sec
subCircuit with size 3
Time =    13.17 sec
subCircuit with size 4
Time =    15.88 sec
subCircuit with size 5
Time =    73.44 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4834  lev = 21
[1;37mex                            :[0m i/o =   16/   20  lat =    0  and =   4834  lev = 21
abc 224> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex09.truth/iter12.aig
abc 224> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     5.48 sec
subCircuit with size 2
Time =     8.06 sec
subCircuit with size 3
Time =    30.08 sec
subCircuit with size 4
Time =   121.34 sec
subCircuit with size 5
Time =   117.42 sec
subCircuit with size 6
Time =   128.39 sec
subCircuit with size 7
Time =   129.75 sec
subCircuit with size 1
Time =     1.43 sec
subCircuit with size 2
Time =     5.24 sec
subCircuit with size 3
Time =    24.46 sec
subCircuit with size 4
Time =   101.90 sec
subCircuit with size 5
