UC Berkeley, ABC 1.01 (compiled Dec  1 2023 18:58:55)
================== Command history ==================
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex00.truth/iter1.aig
read_truth -xf ../../IWLS/benchmarks/ex00.truth 
cec -n lsv/finalProject/experiment/results/ex00.truth/iter0.aig 
source -s abc.rc
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex01.truth
resyn
resyn2
resyn3
source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter0.aig
=====================================================
abc 01> read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex03.truth
abc 02> resyn
abc 05> resyn2
abc 09> resyn3
abc 13> resyn
abc 16> resyn2
abc 20> resyn3
abc 24> resyn
abc 27> resyn2
abc 31> resyn3
abc 35> resyn
abc 38> resyn2
abc 42> resyn3
abc 46> resyn
abc 49> resyn2
abc 53> resyn3
abc 57> resyn
abc 60> resyn2
abc 64> resyn3
abc 68> ps
[1;37mex                            :[0m i/o =   16/    4  lat =    0  and =    471  lev = 16
abc 68> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     4.58 sec
subCircuit with size 2
Time =     8.11 sec
subCircuit with size 3
Time =    25.42 sec
subCircuit with size 4
Time =   124.28 sec
subCircuit with size 5
Time =   362.78 sec
subCircuit with size 6
Time =   214.79 sec
subCircuit with size 7
Time =   231.40 sec
subCircuit with size 1
Time =     2.36 sec
subCircuit with size 2
Time =    11.42 sec
subCircuit with size 3
Time =    49.28 sec
subCircuit with size 4
Time =   109.78 sec
subCircuit with size 5
Time =   140.25 sec
subCircuit with size 6
Time =   162.18 sec
subCircuit with size 7
Time =   136.81 sec
subCircuit with size 1
Time =     2.51 sec
subCircuit with size 2
Time =    10.59 sec
subCircuit with size 3
Time =    25.94 sec
subCircuit with size 4
Time =   139.01 sec
subCircuit with size 5
Time =   135.83 sec
subCircuit with size 6
Time =   167.28 sec
subCircuit with size 7
Time =   147.73 sec
subCircuit with size 1
Time =     6.54 sec
subCircuit with size 2
Time =    10.80 sec
subCircuit with size 3
Time =    38.57 sec
subCircuit with size 4
Time =   870.67 sec
subCircuit with size 5
Time =   131.39 sec
subCircuit with size 1
Time =     7.48 sec
subCircuit with size 2
Time =    12.78 sec
subCircuit with size 3
Time =    16.40 sec
subCircuit with size 4
Time =    19.26 sec
subCircuit with size 5
Time =    29.40 sec
subCircuit with size 6
Time =   210.35 sec
subCircuit with size 7
Time =   141.27 sec
subCircuit with size 1
Time =     2.50 sec
subCircuit with size 2
Time =     5.11 sec
subCircuit with size 3
Time =    15.81 sec
subCircuit with size 4
Time =   108.02 sec
subCircuit with size 5
Time =   114.39 sec
subCircuit with size 1
Time =     3.93 sec
subCircuit with size 2
Time =     7.00 sec
subCircuit with size 3
Time =     8.78 sec
subCircuit with size 4
Time =    17.54 sec
subCircuit with size 5
Time =   273.50 sec
subCircuit with size 6
Time =   125.07 sec
subCircuit with size 7
Time =   131.64 sec
subCircuit with size 1
Time =     3.24 sec
subCircuit with size 2
Time =     7.41 sec
subCircuit with size 3
Time =    32.64 sec
subCircuit with size 4
Time =   131.27 sec
subCircuit with size 5
Time =   161.22 sec
subCircuit with size 6
Time =   118.30 sec
subCircuit with size 7
Time =   124.43 sec
subCircuit with size 1
Time =     1.59 sec
subCircuit with size 2
Time =     8.77 sec
subCircuit with size 3
Time =    23.35 sec
subCircuit with size 4
Time =   124.00 sec
subCircuit with size 5
Time =   117.25 sec
subCircuit with size 6
Time =   144.00 sec
subCircuit with size 7
Time =   141.21 sec
subCircuit with size 1
Time =     3.17 sec
subCircuit with size 2
Time =    12.92 sec
subCircuit with size 3
Time =    76.02 sec
subCircuit with size 4
Time =   127.16 sec
subCircuit with size 5
Time =   174.72 sec
subCircuit with size 6
Time =   602.26 sec
subCircuit with size 7
Time =   524.42 sec
subCircuit with size 1
Time =     2.95 sec
subCircuit with size 2
Time =    20.86 sec
subCircuit with size 3
Time =    45.67 sec
subCircuit with size 4
Time =   120.45 sec
subCircuit with size 5
Time =   115.83 sec
subCircuit with size 6
Time =   164.20 sec
subCircuit with size 7
Time =   126.31 sec
subCircuit with size 1
Time =     3.53 sec
subCircuit with size 2
Time =    10.24 sec
subCircuit with size 3
Time =    43.34 sec
subCircuit with size 4
Time =   118.02 sec
subCircuit with size 5
Time =   116.00 sec
subCircuit with size 6
Time =   129.79 sec
subCircuit with size 7
Time =   135.94 sec
subCircuit with size 1
Time =     7.37 sec
subCircuit with size 2
Time =    13.42 sec
subCircuit with size 3
Time =    23.63 sec
subCircuit with size 4
Time =   132.34 sec
subCircuit with size 5
Time =   112.30 sec
subCircuit with size 6
Time =   117.57 sec
subCircuit with size 7
Time =   214.92 sec
subCircuit with size 1
Time =     2.20 sec
subCircuit with size 2
Time =     7.64 sec
subCircuit with size 3
Time =    28.86 sec
subCircuit with size 4
Time =   109.28 sec
subCircuit with size 5
Time =   141.03 sec
subCircuit with size 6
Time =   116.91 sec
subCircuit with size 7
Time =   131.59 sec
subCircuit with size 1
Time =     2.75 sec
subCircuit with size 2
Time =    11.15 sec
subCircuit with size 3
Time =    24.64 sec
subCircuit with size 4
Time =   129.12 sec
subCircuit with size 5
Time =   155.70 sec
subCircuit with size 6
Time =   135.45 sec
subCircuit with size 7
Time =   145.54 sec
subCircuit with size 1
Time =     3.84 sec
subCircuit with size 2
Time =     6.56 sec
subCircuit with size 3
Time =    24.00 sec
subCircuit with size 4
Time =   114.57 sec
subCircuit with size 5
Time =   114.90 sec
subCircuit with size 6
Time =   122.16 sec
subCircuit with size 7
Time =   140.90 sec
subCircuit with size 1
Time =     2.88 sec
subCircuit with size 2
Time =     4.56 sec
subCircuit with size 3
Time =     8.66 sec
subCircuit with size 4
Time =    12.01 sec
subCircuit with size 5
Time =    24.04 sec
subCircuit with size 6
Time =   157.13 sec
subCircuit with size 7
Time =   157.51 sec
subCircuit with size 1
Time =     2.03 sec
subCircuit with size 2
Time =     8.59 sec
subCircuit with size 3
Time =    29.83 sec
subCircuit with size 4
Time =    84.22 sec
subCircuit with size 5
Time =   112.78 sec
subCircuit with size 6
Time =   128.85 sec
subCircuit with size 7
Time =   129.17 sec
subCircuit with size 1
Time =     3.01 sec
subCircuit with size 2
Time =     4.75 sec
subCircuit with size 3
Time =     6.64 sec
subCircuit with size 4
Time =    22.33 sec
subCircuit with size 5
Time =   137.92 sec
subCircuit with size 6
Time =   570.49 sec
subCircuit with size 7
Time =   133.56 sec
subCircuit with size 1
Time =     2.32 sec
subCircuit with size 2
Time =     5.20 sec
subCircuit with size 3
Time =     7.07 sec
subCircuit with size 4
Time =    49.27 sec
subCircuit with size 5
Time =   122.26 sec
subCircuit with size 6
Time =   124.54 sec
subCircuit with size 7
Time =   132.60 sec
subCircuit with size 1
Time =     6.34 sec
subCircuit with size 2
Time =     8.19 sec
subCircuit with size 3
Time =    15.37 sec
subCircuit with size 4
Time =   413.88 sec
subCircuit with size 5
Time =   139.69 sec
subCircuit with size 1
Time =     3.23 sec
subCircuit with size 2
Time =    10.87 sec
subCircuit with size 3
Time =    49.34 sec
subCircuit with size 4
Time =   199.75 sec
subCircuit with size 5
Time =   113.19 sec
subCircuit with size 6
Time =   120.51 sec
subCircuit with size 7
Time =   171.68 sec
subCircuit with size 1
Time =     5.70 sec
subCircuit with size 2
Time =    13.47 sec
subCircuit with size 3
Time =    55.97 sec
subCircuit with size 4
