UC Berkeley, ABC 1.01 (compiled Dec  1 2023 18:58:55)
================== Command history ==================
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex01.truth
resyn
resyn2
resyn3
source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex01.truth/iter0.aig
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex03.truth
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex04.truth
source -s abc.rc
read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex05.truth
=====================================================
abc 01> read_truth -xf  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/../../../../../IWLS/benchmarks/ex06.truth
abc 02> resyn
abc 05> resyn2
abc 09> resyn3
abc 13> resyn
abc 16> resyn2
abc 20> resyn3
abc 24> resyn
abc 27> resyn2
abc 31> resyn3
abc 35> resyn
abc 38> resyn2
abc 42> resyn3
abc 46> resyn
abc 49> resyn2
abc 53> resyn3
abc 57> resyn
abc 60> resyn2
abc 64> resyn3
abc 68> ps
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =    103  lev =  8
abc 68> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.46 sec
subCircuit with size 2
Time =     2.13 sec
subCircuit with size 3
Time =     7.05 sec
subCircuit with size 4
Time =    36.57 sec
subCircuit with size 5
Time =   107.89 sec
subCircuit with size 6
Time =   105.52 sec
subCircuit with size 7
Time =   104.59 sec
subCircuit with size 1
Time =     0.57 sec
subCircuit with size 2
Time =     1.81 sec
subCircuit with size 3
Time =     5.24 sec
subCircuit with size 4
Time =    18.80 sec
Success reduce subcircuit from 7 to 4
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =    100  lev =  9
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     99  lev =  8
abc 80> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter0.aig
abc 80> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.28 sec
subCircuit with size 2
Time =     0.42 sec
subCircuit with size 3
Time =     0.80 sec
subCircuit with size 4
Time =    10.20 sec
subCircuit with size 5
Time =    88.13 sec
subCircuit with size 6
Time =   103.88 sec
subCircuit with size 7
Time =   104.95 sec
subCircuit with size 1
Time =     0.20 sec
subCircuit with size 2
Time =     0.82 sec
subCircuit with size 3
Time =     2.76 sec
subCircuit with size 4
Time =    19.04 sec
subCircuit with size 5
Time =   105.31 sec
subCircuit with size 6
Time =   109.74 sec
subCircuit with size 1
Time =     0.30 sec
subCircuit with size 2
Time =     0.73 sec
subCircuit with size 3
Time =     5.32 sec
subCircuit with size 4
Time =    15.59 sec
subCircuit with size 5
Time =    72.37 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     99  lev =  8
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     99  lev =  8
abc 92> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter1.aig
abc 92> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.20 sec
subCircuit with size 2
Time =     0.51 sec
subCircuit with size 3
Time =     2.73 sec
subCircuit with size 4
Time =     4.84 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     99  lev =  9
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     98  lev =  8
abc 104> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter2.aig
abc 104> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.49 sec
subCircuit with size 2
Time =     1.02 sec
subCircuit with size 3
Time =     1.95 sec
subCircuit with size 4
Time =    20.45 sec
subCircuit with size 5
Time =    73.28 sec
subCircuit with size 6
Time =    94.76 sec
Success reduce subcircuit from 6 to 6
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     98  lev =  9
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     98  lev =  8
abc 116> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter3.aig
abc 116> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.93 sec
subCircuit with size 2
Time =     1.36 sec
subCircuit with size 3
Time =     5.59 sec
subCircuit with size 4
Time =    25.12 sec
subCircuit with size 5
Time =   106.12 sec
subCircuit with size 6
Time =   103.97 sec
subCircuit with size 7
Time =   106.43 sec
subCircuit with size 1
Time =     0.57 sec
subCircuit with size 2
Time =     2.60 sec
subCircuit with size 3
Time =     7.43 sec
subCircuit with size 4
Time =    40.51 sec
subCircuit with size 5
Time =   106.60 sec
subCircuit with size 6
Time =   110.85 sec
subCircuit with size 7
Time =   109.45 sec
subCircuit with size 1
Time =     1.05 sec
subCircuit with size 2
Time =     5.93 sec
subCircuit with size 3
Time =    18.30 sec
subCircuit with size 4
Time =    83.45 sec
subCircuit with size 5
Time =    65.99 sec
Success reduce subcircuit from 7 to 5
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     96  lev = 10
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     96  lev =  8
abc 128> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter4.aig
abc 128> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.60 sec
subCircuit with size 2
Time =     1.51 sec
subCircuit with size 3
Time =     7.24 sec
subCircuit with size 4
Time =    23.50 sec
subCircuit with size 5
Time =   104.18 sec
subCircuit with size 6
Time =   112.91 sec
subCircuit with size 7
Time =   106.85 sec
subCircuit with size 1
Time =     0.19 sec
subCircuit with size 2
Time =     0.46 sec
subCircuit with size 3
Time =     2.27 sec
subCircuit with size 4
Time =    11.76 sec
subCircuit with size 5
Time =   104.72 sec
subCircuit with size 6
Time =    52.74 sec
Success reduce subcircuit from 6 to 6
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     96  lev =  9
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     96  lev =  8
abc 140> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter5.aig
abc 140> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.15 sec
subCircuit with size 2
Time =     0.54 sec
subCircuit with size 3
Time =     2.02 sec
subCircuit with size 4
Time =     5.87 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     96  lev =  8
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     96  lev =  8
abc 152> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter6.aig
abc 152> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.17 sec
subCircuit with size 2
Time =     0.47 sec
subCircuit with size 3
Time =     2.04 sec
subCircuit with size 4
Time =    10.20 sec
subCircuit with size 5
Time =    81.76 sec
subCircuit with size 6
Time =   103.62 sec
subCircuit with size 7
Time =   108.67 sec
subCircuit with size 1
Time =     0.22 sec
subCircuit with size 2
Time =     0.48 sec
subCircuit with size 3
Time =     2.69 sec
subCircuit with size 4
Time =    13.55 sec
subCircuit with size 5
Time =    91.18 sec
subCircuit with size 6
Time =   104.57 sec
subCircuit with size 1
Time =     0.52 sec
subCircuit with size 2
Time =     1.08 sec
subCircuit with size 3
Time =     5.54 sec
subCircuit with size 4
Time =    25.17 sec
subCircuit with size 5
Time =    58.43 sec
Success reduce subcircuit from 7 to 5
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     94  lev =  8
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     94  lev =  8
abc 164> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter7.aig
abc 164> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.20 sec
subCircuit with size 2
Time =     0.46 sec
subCircuit with size 3
Time =     0.90 sec
subCircuit with size 4
Time =     9.52 sec
subCircuit with size 5
Time =    47.81 sec
subCircuit with size 6
Time =    95.56 sec
Success reduce subcircuit from 6 to 6
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     94  lev =  9
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     94  lev =  8
abc 176> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter8.aig
abc 176> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.31 sec
subCircuit with size 2
Time =     1.58 sec
subCircuit with size 3
Time =     5.10 sec
subCircuit with size 4
Time =    25.78 sec
subCircuit with size 5
Time =   108.54 sec
subCircuit with size 6
Time =   122.15 sec
subCircuit with size 7
Time =   104.80 sec
subCircuit with size 1
Time =     0.23 sec
subCircuit with size 2
Time =     0.85 sec
subCircuit with size 3
Time =     3.25 sec
subCircuit with size 4
Time =    40.55 sec
subCircuit with size 5
Time =   106.45 sec
subCircuit with size 6
Time =   104.86 sec
subCircuit with size 7
Time =   104.10 sec
subCircuit with size 1
Time =     0.29 sec
subCircuit with size 2
Time =     0.69 sec
subCircuit with size 3
Time =     1.35 sec
subCircuit with size 4
Time =    10.48 sec
subCircuit with size 5
Time =    56.55 sec
subCircuit with size 6
Time =   103.38 sec
subCircuit with size 7
Time =   107.80 sec
subCircuit with size 1
Time =     0.82 sec
subCircuit with size 2
Time =     3.55 sec
subCircuit with size 3
Time =    22.83 sec
subCircuit with size 4
Time =    83.25 sec
subCircuit with size 5
Time =   119.35 sec
subCircuit with size 6
Time =   107.76 sec
subCircuit with size 7
Time =   105.79 sec
subCircuit with size 1
Time =     0.19 sec
subCircuit with size 2
Time =     0.45 sec
subCircuit with size 3
Time =     2.23 sec
subCircuit with size 4
Time =     8.12 sec
subCircuit with size 5
Time =    42.71 sec
subCircuit with size 6
Time =   105.07 sec
subCircuit with size 7
Time =   110.22 sec
subCircuit with size 1
Time =     0.81 sec
subCircuit with size 2
Time =     3.64 sec
subCircuit with size 3
Time =    25.91 sec
subCircuit with size 4
Time =    92.02 sec
subCircuit with size 5
Time =   105.31 sec
subCircuit with size 6
Time =   106.77 sec
subCircuit with size 7
Time =   110.50 sec
subCircuit with size 1
Time =     0.65 sec
subCircuit with size 2
Time =     1.90 sec
subCircuit with size 3
Time =     8.33 sec
subCircuit with size 4
Time =    49.15 sec
subCircuit with size 5
Time =   134.17 sec
subCircuit with size 6
Time =   108.46 sec
subCircuit with size 7
Time =   125.57 sec
subCircuit with size 1
Time =     0.20 sec
subCircuit with size 2
Time =     0.47 sec
subCircuit with size 3
Time =     0.91 sec
subCircuit with size 4
Time =    13.09 sec
subCircuit with size 5
Time =    42.02 sec
subCircuit with size 6
Time =   106.61 sec
subCircuit with size 7
Time =   108.07 sec
subCircuit with size 1
Time =     0.28 sec
subCircuit with size 2
Time =     0.39 sec
subCircuit with size 3
Time =     2.16 sec
subCircuit with size 4
Time =    11.47 sec
subCircuit with size 5
Time =    58.60 sec
subCircuit with size 6
Time =   103.47 sec
subCircuit with size 7
Time =   110.25 sec
subCircuit with size 1
Time =     0.69 sec
subCircuit with size 2
Time =     2.03 sec
subCircuit with size 3
Time =     6.04 sec
subCircuit with size 4
Time =    39.28 sec
subCircuit with size 5
Time =   108.05 sec
subCircuit with size 6
Time =   105.12 sec
subCircuit with size 7
Time =   106.64 sec
subCircuit with size 1
Time =     0.35 sec
subCircuit with size 2
Time =     1.45 sec
subCircuit with size 3
Time =     5.10 sec
subCircuit with size 4
Time =    41.08 sec
subCircuit with size 5
Time =   103.14 sec
subCircuit with size 6
Time =   133.48 sec
subCircuit with size 7
Time =   118.32 sec
subCircuit with size 1
Time =     0.47 sec
subCircuit with size 2
Time =     1.26 sec
subCircuit with size 3
Time =     6.81 sec
subCircuit with size 4
Time =    19.35 sec
Success reduce subcircuit from 7 to 4
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     91  lev =  8
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     91  lev =  8
abc 188> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter9.aig
abc 188> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.49 sec
subCircuit with size 2
Time =     1.17 sec
subCircuit with size 3
Time =     7.32 sec
subCircuit with size 4
Time =    35.41 sec
subCircuit with size 5
Time =   102.22 sec
subCircuit with size 6
Time =   123.55 sec
subCircuit with size 7
Time =   110.92 sec
subCircuit with size 1
Time =     0.29 sec
subCircuit with size 2
Time =     1.47 sec
subCircuit with size 3
Time =     4.54 sec
subCircuit with size 4
Time =    26.31 sec
subCircuit with size 5
Time =   125.60 sec
subCircuit with size 6
Time =   104.53 sec
subCircuit with size 7
Time =   106.74 sec
subCircuit with size 1
Time =     0.42 sec
subCircuit with size 2
Time =     0.95 sec
subCircuit with size 3
Time =     6.44 sec
subCircuit with size 4
Time =    54.45 sec
subCircuit with size 5
Time =   103.77 sec
subCircuit with size 6
Time =   102.84 sec
subCircuit with size 7
Time =   109.06 sec
subCircuit with size 1
Time =     0.21 sec
subCircuit with size 2
Time =     0.47 sec
subCircuit with size 3
Time =     3.53 sec
subCircuit with size 4
Time =    25.61 sec
subCircuit with size 5
Time =   153.20 sec
subCircuit with size 6
Time =   103.30 sec
subCircuit with size 7
Time =   106.66 sec
subCircuit with size 1
Time =     0.58 sec
subCircuit with size 2
Time =     1.34 sec
subCircuit with size 3
Time =     2.45 sec
subCircuit with size 4
Time =    21.84 sec
subCircuit with size 5
Time =   112.20 sec
subCircuit with size 6
Time =   104.86 sec
subCircuit with size 7
Time =   106.71 sec
subCircuit with size 1
Time =     0.21 sec
subCircuit with size 2
Time =     0.49 sec
subCircuit with size 3
Time =     3.12 sec
subCircuit with size 4
Time =    18.09 sec
subCircuit with size 5
Time =    81.63 sec
Success reduce subcircuit from 6 to 5
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     91  lev =  9
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     89  lev =  8
abc 200> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter10.aig
abc 200> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.51 sec
subCircuit with size 2
Time =     1.79 sec
subCircuit with size 3
Time =     7.98 sec
subCircuit with size 4
Time =    37.55 sec
subCircuit with size 5
Time =    85.97 sec
Success reduce subcircuit from 7 to 5
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     87  lev =  8
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     87  lev =  8
abc 212> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter11.aig
abc 212> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.14 sec
subCircuit with size 2
Time =     0.42 sec
subCircuit with size 3
Time =     3.36 sec
subCircuit with size 4
Time =    15.21 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     87  lev =  8
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     87  lev =  8
abc 224> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter12.aig
abc 224> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.53 sec
subCircuit with size 2
Time =     1.32 sec
subCircuit with size 3
Time =     7.18 sec
subCircuit with size 4
Time =    33.22 sec
subCircuit with size 5
Time =   108.41 sec
subCircuit with size 6
Time =   115.83 sec
subCircuit with size 7
Time =   113.08 sec
subCircuit with size 1
Time =     0.12 sec
subCircuit with size 2
Time =     0.49 sec
subCircuit with size 3
Time =     4.13 sec
subCircuit with size 4
Time =    20.42 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     87  lev =  8
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     87  lev =  8
abc 236> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter13.aig
abc 236> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.95 sec
subCircuit with size 2
Time =     1.47 sec
subCircuit with size 3
Time =     5.96 sec
subCircuit with size 4
Time =    35.85 sec
subCircuit with size 5
Time =   104.58 sec
subCircuit with size 6
Time =   106.69 sec
subCircuit with size 7
Time =   110.86 sec
subCircuit with size 1
Time =     0.62 sec
subCircuit with size 2
Time =     2.20 sec
subCircuit with size 3
Time =    10.89 sec
subCircuit with size 4
Time =    56.46 sec
subCircuit with size 5
Time =   123.76 sec
subCircuit with size 6
Time =   104.49 sec
subCircuit with size 7
Time =   105.20 sec
subCircuit with size 1
Time =     0.25 sec
subCircuit with size 2
Time =     0.65 sec
subCircuit with size 3
Time =     2.64 sec
subCircuit with size 4
Time =    28.90 sec
subCircuit with size 5
Time =   105.81 sec
subCircuit with size 6
Time =   105.91 sec
subCircuit with size 7
Time =   110.68 sec
subCircuit with size 1
Time =     0.46 sec
subCircuit with size 2
Time =     1.43 sec
subCircuit with size 3
Time =     4.46 sec
subCircuit with size 4
Time =    27.94 sec
subCircuit with size 5
Time =   124.17 sec
subCircuit with size 6
Time =   129.50 sec
subCircuit with size 7
Time =   109.53 sec
subCircuit with size 1
Time =     0.39 sec
subCircuit with size 2
Time =     1.81 sec
subCircuit with size 3
Time =     6.86 sec
subCircuit with size 4
Time =    46.31 sec
subCircuit with size 5
Time =    50.60 sec
Success reduce subcircuit from 5 to 5
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     87  lev =  8
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     86  lev =  8
abc 248> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter14.aig
abc 248> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.39 sec
subCircuit with size 2
Time =     0.92 sec
subCircuit with size 3
Time =     5.39 sec
subCircuit with size 4
Time =    22.27 sec
subCircuit with size 5
Time =   104.21 sec
subCircuit with size 1
Time =     0.33 sec
subCircuit with size 2
Time =     0.69 sec
subCircuit with size 3
Time =     4.75 sec
subCircuit with size 4
Time =    21.88 sec
subCircuit with size 5
Time =    97.43 sec
subCircuit with size 6
Time =   102.30 sec
subCircuit with size 7
Time =   103.47 sec
subCircuit with size 1
Time =     0.11 sec
subCircuit with size 2
Time =     0.95 sec
subCircuit with size 3
Time =     2.37 sec
subCircuit with size 4
Time =    10.62 sec
subCircuit with size 5
Time =    44.30 sec
subCircuit with size 6
Time =   104.19 sec
subCircuit with size 7
Time =   103.33 sec
subCircuit with size 1
Time =     0.14 sec
subCircuit with size 2
Time =     0.34 sec
subCircuit with size 3
Time =     1.63 sec
subCircuit with size 4
Time =     2.37 sec
Success reduce subcircuit from 5 to 4
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     85  lev =  9
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     85  lev =  8
abc 260> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter15.aig
abc 260> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.54 sec
subCircuit with size 2
Time =     1.55 sec
subCircuit with size 3
Time =     7.60 sec
subCircuit with size 4
Time =    35.52 sec
subCircuit with size 5
Time =   151.40 sec
subCircuit with size 6
Time =   105.71 sec
subCircuit with size 7
Time =   106.62 sec
subCircuit with size 1
Time =     0.22 sec
subCircuit with size 2
Time =     0.64 sec
subCircuit with size 3
Time =     0.92 sec
subCircuit with size 4
Time =     7.24 sec
subCircuit with size 5
Time =    56.01 sec
subCircuit with size 6
Time =   104.07 sec
subCircuit with size 1
Time =     0.20 sec
subCircuit with size 2
Time =     0.48 sec
subCircuit with size 3
Time =     0.89 sec
subCircuit with size 4
Time =     6.47 sec
subCircuit with size 5
Time =    56.43 sec
subCircuit with size 6
Time =   116.42 sec
subCircuit with size 1
Time =     0.25 sec
subCircuit with size 2
Time =     1.54 sec
subCircuit with size 3
Time =     9.31 sec
subCircuit with size 4
Time =    21.56 sec
Success reduce subcircuit from 4 to 4
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     86  lev =  8
[1;37mex                            :[0m i/o =   14/    5  lat =    0  and =     85  lev =  8
abc 272> write_aiger  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/results/ex06.truth/iter16.aig
abc 272> source  /home/wish/LSV/finalProject/LSV-PA/lsv/finalProject/experiment/lsv_reduce.dofile
subCircuit with size 1
Time =     0.38 sec
subCircuit with size 2
Time =     0.87 sec
subCircuit with size 3
Time =     1.76 sec
subCircuit with size 4
Time =    13.41 sec
subCircuit with size 5
Time =   112.88 sec
subCircuit with size 6
Time =   135.34 sec
subCircuit with size 7
Time =   106.60 sec
subCircuit with size 1
Time =     0.30 sec
subCircuit with size 2
Time =     0.75 sec
subCircuit with size 3
Time =     3.70 sec
subCircuit with size 4
Time =    10.77 sec
subCircuit with size 5
Time =    37.40 sec
subCircuit with size 6
Time =   109.74 sec
subCircuit with size 7
Time =   113.81 sec
subCircuit with size 1
Time =     0.19 sec
subCircuit with size 2
Time =     0.46 sec
subCircuit with size 3
Time =     1.98 sec
subCircuit with size 4
Time =    16.23 sec
subCircuit with size 5
Time =    53.84 sec
subCircuit with size 6
Time =   104.39 sec
subCircuit with size 7
Time =   107.92 sec
subCircuit with size 1
Time =     0.29 sec
subCircuit with size 2
Time =     0.64 sec
subCircuit with size 3
Time =     1.21 sec
subCircuit with size 4
Time =    11.48 sec
subCircuit with size 5
Time =    71.49 sec
subCircuit with size 6
